{
  "materials_v1.1_fewshot_3590_gen50_sel30_ceTrue": {
    "summary": "A randomized controlled pilot study investigated the short-term effects of rye bran bread intake on prostate cancer patients. Ten men consumed 295 g of rye bran bread daily, while eight men consumed 275 g of wheat bread as a control for three weeks. The study found a significant increase in plasma enterolactone and apoptotic index in the rye group, with minimal changes in PSA levels, sex hormones, and other biomarkers.",
    "questions": [
      "Is high intake of rye bran bread suggested to increase apoptosis in prostate tumors?",
      "Did the apoptotic index in the rye group increase from 2.1% to 5.9%?",
      "Were there seven cases in the control group where the TUNEL index was measured?",
      "Were there four cases in the rye group where the TUNEL index was measured?",
      "Did the study suggest that rye bran bread might benefit prostate cancer patients?",
      "Were only small changes observed in plasma concentrations of PSA?",
      "Did the study find a significant increase in plasma enterolactone only in the rye group?",
      "Did the rye group show a significant increase in plasma enterolactone?",
      "Did the study focus on the effects of rye bran bread on prostate cancer?",
      "Did the study suggest a potential benefit of rye bran bread for prostate cancer?",
      "Did the study involve a pilot study design?",
      "Did the control group consume 275 g of wheat bread daily?",
      "Did the study measure the effects of bread intake on prostate cancer biomarkers?",
      "Did the study involve men with conservatively treated prostate cancer?",
      "Were the effects of rye bran bread compared to a control group?",
      "Was the increase in the apoptotic index statistically significant with P<0.005?",
      "Was insulin-like growth factor (IGF)-I measured in the study?",
      "Did both groups experience a significant decrease in weight?",
      "Did the study conclude with suggestions for further research on rye bran bread and prostate cancer?",
      "Were ultrasound-guided core biopsies of the prostate performed?",
      "Did the study involve dietary supplementation?",
      "Were urine samples taken as part of the study?",
      "Was the increase in apoptosis observed specifically in the rye group?",
      "Was the study a randomized controlled trial?",
      "Was the apoptotic index measured using the TUNEL index?",
      "Was the fiber content of the control bread similar to that of the rye bread?",
      "Was the study described as a short-term intervention?",
      "Did the study report a significant increase in apoptosis in prostate tumors?",
      "Were ten men assigned to the rye bran bread group?",
      "Did the study involve a comparison between rye and wheat bread?"
    ]
  },
  "ground_truths_3590_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "I don't know",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1732_gen50_sel30_ceTrue": {
    "summary": "Methylmercury (MM) is a highly potent neurotoxic agent known for its environmental pollution and severe health impacts. Major epidemics of MM poisoning have been documented in several countries, including Japan, Iraq, and Pakistan, primarily through the consumption of contaminated fish or grain. Despite extensive research, there is currently no effective antidote for MM's effects on the central nervous system, though ongoing studies offer hope for future therapies.",
    "questions": [
      "Have studies over several decades provided insights into methylmercury's effects?",
      "Have sporadic incidences of methylmercury poisoning occurred in the United States?",
      "Does the document suggest hope for more effective therapy in acute cases of methylmercury poisoning?",
      "Is there an effective antidote for methylmercury's effects on the central nervous system?",
      "Can exposure to methylmercury occur through ingestion of poisoned fish?",
      "Has methylmercury's role in environmental pollution been well documented?",
      "Did a major epidemic of methylmercury poisoning occur in Japan?",
      "Has Canada experienced sporadic incidences of methylmercury poisoning?",
      "Has Iraq experienced a major epidemic of methylmercury poisoning?",
      "Is methylmercury described as a potent neurotoxic agent?",
      "Is methylmercury poisoning described as having no effective antidote?",
      "Did Pakistan suffer from a major epidemic due to methylmercury?",
      "Has Guatemala been affected by a major methylmercury poisoning epidemic?",
      "Is Ghana listed as a country with a major methylmercury epidemic?",
      "Are the effects of methylmercury poisoning described as neurotoxic?",
      "Is the ingestion of contaminated fish a documented exposure route for methylmercury?",
      "Is Fetal Minamata disease associated with methylmercury poisoning?",
      "Are the documented epidemics of methylmercury poisoning described as major?",
      "Are the documented studies on methylmercury described as providing insight?",
      "Is methylmercury poisoning linked to environmental pollution?",
      "Are the effects of methylmercury poisoning described as impacting the central nervous system?",
      "Is the misuse of treated grain a potential exposure route for methylmercury?",
      "Is grain treated with methylmercury used as a fungicide?",
      "Is methylmercury poisoning described as having occurred in multiple countries?",
      "Does the document mention any hope for future therapies for methylmercury poisoning?",
      "Are the documented studies on methylmercury described as vast?",
      "Does the document mention any specific antidote for methylmercury poisoning?",
      "Is methylmercury described as a fungicide in the document?",
      "Is methylmercury poisoning associated with both fish and grain?",
      "Are the effects of methylmercury poisoning described as severe?"
    ]
  },
  "ground_truths_1732_30": [
    "Yes",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_2212_gen50_sel30_ceTrue": {
    "summary": "Asthma affects 300 million people globally and causes over 250,000 deaths annually, with its prevalence rising despite improved treatments. The increase is particularly noted in low and middle-income countries and certain ethnic groups, influenced by environmental factors, host susceptibility, and stress.",
    "questions": [
      "Are there more than 250,000 asthma-related deaths each year?",
      "Is the prevalence of asthma increasing in low and middle-income countries?",
      "Do environmental factors contribute to the spatio-temporal variations in asthma prevalence?",
      "Are spatio-temporal variations in asthma prevalence observed?",
      "Is the prevalence of asthma described as increasing in certain ethnic groups?",
      "Is the involvement of host susceptibility in asthma prevalence a recent argument?",
      "Are host susceptibility and stress mentioned as recent factors in asthma prevalence?",
      "Is host susceptibility considered a factor in the increase of asthma prevalence?",
      "Does asthma affect 300 million people worldwide?",
      "Are certain ethnic groups experiencing a rise in asthma prevalence?",
      "Is asthma described as a phenotypically heterogeneous disorder?",
      "Are spatio-temporal variations in asthma prevalence mentioned?",
      "Are further investigations needed to understand asthma prevalence changes?",
      "Is stress mentioned as a contributing factor to the rise in asthma cases?",
      "Is the prevalence of asthma described as increasing?",
      "Are environmental factors mentioned as influencing asthma prevalence?",
      "Are 300 million people affected by asthma according to the document?",
      "Is the prevalence of asthma described as heterogeneous?",
      "Are environmental factors linked to asthma prevalence changes?",
      "Are arguments in favor of host susceptibility recent according to the document?",
      "Are host susceptibility and stress linked to asthma prevalence in the document?",
      "Is stress considered a factor in asthma prevalence changes?",
      "Is the prevalence of asthma stagnating in some areas?",
      "Does the document suggest that stress affects asthma prevalence?",
      "Has asthma treatment improved over time?",
      "Is the document discussing asthma prevalence in relation to multifactorial origins?",
      "Is the document discussing asthma prevalence in relation to environmental factors?",
      "Are multifactorial origins of asthma discussed in the document?",
      "Is the document discussing asthma prevalence in relation to host susceptibility?",
      "Is the document discussing asthma prevalence in relation to phenotypic heterogeneity?"
    ]
  },
  "ground_truths_2212_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1309_gen50_sel30_ceTrue": {
    "summary": "The National Electronic Injury Surveillance System (NEISS) data from August to September 2003 was analyzed to evaluate food allergy-related emergency department visits in the U.S. The study estimated 20,821 ED visits, including 2,333 for anaphylaxis and 520 hospitalizations, with shellfish being the most common allergen for those over six years old. The analysis highlighted a potential underdiagnosis of anaphylaxis, as only 19% of patients received epinephrine, and 57% of likely anaphylactic events were not diagnosed as such in the ED.",
    "questions": [
      "Did 57% of likely anaphylactic events lack an ED diagnosis of anaphylaxis according to the study?",
      "Did only 19% of patients receive epinephrine for their allergic reactions?",
      "Is the NEISS data considered a useful tool for assessing the magnitude and severity of food-allergic events?",
      "Did the study estimate a total of 20,821 hospital ED visits due to food allergies?",
      "Was shellfish identified as the most frequently implicated food allergen for individuals aged 6 years and older?",
      "Were eggs, fruit, peanuts, and tree nuts more commonly implicated in allergic events for children aged 5 years or younger?",
      "Was the objective of the study to assess the magnitude and severity of adverse events attributable to food allergies?",
      "Did the study estimate 520 hospitalizations caused by food allergies during the study period?",
      "Was the study's conclusion that NEISS data can help assess the severity of food-allergic events?",
      "Were children aged 5 years or younger more affected by eggs, fruit, peanuts, and tree nuts?",
      "Was the study's conclusion that NEISS data is useful for assessing food-allergic events?",
      "Were 2,333 of the estimated ED visits attributed to anaphylaxis?",
      "Did the study find that a significant portion of anaphylactic events were not diagnosed as such in the ED?",
      "Did 24% of the ED visits involve children aged 5 years or younger?",
      "Did the study find that a significant number of anaphylactic events were not diagnosed in the ED?",
      "Did the study find that shellfish was the most common allergen for individuals over 6 years old?",
      "Did the study find that a large percentage of likely anaphylactic events were not diagnosed as such?",
      "Did the study find that only a small percentage of patients received epinephrine?",
      "Did the study suggest that there is an underdiagnosis of anaphylactic events in EDs?",
      "Was the analysis based on data from 34 participating emergency departments?",
      "Did the study suggest that there is an underdiagnosis of anaphylactic events in emergency departments?",
      "Was the median age of patients visiting the ED for food allergies 26 years?",
      "Was the data for the analysis collected from the National Electronic Injury Surveillance System (NEISS)?",
      "Did the study use a nationally representative probability sample from hospital emergency departments?",
      "Was there a symposium in 2005 that established criteria for diagnosing anaphylaxis?",
      "Was the study's conclusion that NEISS data is valuable for understanding food-allergic events?",
      "Did the study find that shellfish was a common allergen for individuals over 6 years old?",
      "Were there any reported deaths due to food allergies during the study period?",
      "Did the study find that a minority of patients received epinephrine for their allergic reactions?",
      "Did the study find that shellfish was a common allergen for those aged 6 and older?"
    ]
  },
  "ground_truths_1309_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1599_gen50_sel30_ceTrue": {
    "summary": "The study measured the total, soluble, and insoluble oxalate contents in ten spices commonly used in Indian cuisine, revealing significant variability. Green cardamom had the highest total and soluble oxalate content, while nutmeg had the lowest. The percentage of soluble oxalate content varied widely, indicating potential dietary implications for individuals prone to kidney stones.",
    "questions": [
      "Did the study report that the percentage of soluble oxalate content ranged from 4.7 to 99.1%?",
      "Did the study find that soluble oxalate content ranged from 41 to 3,977 mg/100 g DM?",
      "Did the study find that the percentage of soluble oxalate content ranges from 4.7 to 99.1%?",
      "Did the soluble oxalate content of green cardamom measure 3,977 mg/100 g DM?",
      "Is the soluble oxalate content of green cardamom reported as 3,977 mg/100 g DM?",
      "Is the total oxalate content of green cardamom reported as 4,014 mg/100 g DM?",
      "Is the total oxalate content of green cardamom reported as 4,014 mg/100 g DM?",
      "Was the total oxalate content of nutmeg measured at 194 mg/100 g DM?",
      "Did the study find that some spices present no risk to people liable to kidney stone formation?",
      "Did the study report that some spices should be used in moderation due to high soluble oxalate content?",
      "Is the soluble oxalate content of nutmeg reported as 41 mg/100 g DM?",
      "Is the soluble oxalate content of nutmeg reported as 41 mg/100 g DM?",
      "Did the study measure oxalate contents in spices commonly used in Indian cuisine?",
      "Is the total oxalate content of nutmeg reported as 194 mg/100 g DM?",
      "Did the study find that some spices can supply significant amounts of soluble oxalates?",
      "Is the percentage of soluble oxalate content in spices a concern for kidney stone formation?",
      "Did the study measure oxalate contents in spices used in Indian cuisine?",
      "Did the document mention that previous studies have shown variable amounts of total oxalates in spices?",
      "Did the study measure oxalate contents in ten different spices?",
      "Is cardamom listed as one of the spices analyzed for oxalate content?",
      "Did the document mention that soluble oxalate content can range up to 99.1% of total oxalate content?",
      "Is cumin listed as one of the spices analyzed for oxalate content?",
      "Is the soluble oxalate content of green cardamom the highest among the spices studied?",
      "Is garlic included in the list of spices studied for oxalate content?",
      "Did the study include garlic as one of the spices analyzed for oxalate content?",
      "Is ginger included in the spices studied for oxalate content?",
      "Is the soluble oxalate content of nutmeg the lowest among the spices studied?",
      "Did the study find that the percentage of soluble oxalate content varies widely among spices?",
      "Is the total oxalate content of green cardamom the highest among the spices studied?",
      "Did the document mention that some spices pose no risk to people prone to kidney stones?"
    ]
  },
  "ground_truths_1599_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_3246_gen50_sel30_ceTrue": {
    "summary": "The document discusses a study using NHANES 1999-2002 data to analyze the health benefits of bean consumption, revealing that bean consumers have better nutrient intake, lower body weight, smaller waist circumference, and reduced systolic blood pressure compared to non-consumers. The study highlights significant associations between bean consumption and reduced risks of obesity and increased waist size.",
    "questions": [
      "Did bean consumers have higher intakes of dietary fiber compared to non-consumers?",
      "Did bean consumers have a smaller waist size with a p-value of 0.043?",
      "Did bean consumers have a 22% reduced risk of being obese?",
      "Was the objective to determine the association of consuming beans on nutrient intakes?",
      "Was there a 23% reduced risk of increased waist size for bean consumers?",
      "Did the study find bean consumers had better overall nutrient intake levels?",
      "Did bean consumers have higher copper intake compared to non-consumers?",
      "Was baked bean consumption associated with lower systolic blood pressure?",
      "Did the study find bean consumers had smaller waist circumferences than non-consumers?",
      "Did the study find bean consumers had better body weights compared to non-consumers?",
      "Did bean consumers have higher magnesium intake than non-consumers?",
      "Were bean consumers associated with reduced systolic blood pressure?",
      "Did the study find bean consumption associated with greater nutrient intake?",
      "Was iron intake higher for bean consumers relative to non-consumers?",
      "Was the p-value for lower body weight among bean consumers 0.008?",
      "Were bean consumers found to have lower body weights than non-consumers?",
      "Was potassium intake higher among bean consumers than non-consumers?",
      "Was the association between bean consumption and health parameters positive?",
      "Did the study conclude that bean consumption supports improved health parameters?",
      "Were the benefits of bean consumption supported by the study's data?",
      "Did the study analyze nutrient intakes between bean consumers and non-consumers?",
      "Did the study mention a reduced risk of increased waist size for bean consumers?",
      "Did the study use observational trials to examine beans as a separate food variable?",
      "Was the p-value for reduced risk of increased waist size 0.018?",
      "Was the risk of obesity reduced among bean consumers?",
      "Did the study mention the benefits of bean consumption on nutrient intake?",
      "Was the study based on data from NHANES 1999-2002?",
      "Did the study find significant associations between bean consumption and health?",
      "Was the study's conclusion based on comparisons between bean consumers and non-consumers?",
      "Was the study's conclusion supportive of bean consumption for health improvement?"
    ]
  },
  "ground_truths_3246_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_3215_gen50_sel30_ceTrue": {
    "summary": "The study investigated the relationship between maternal beef consumption during pregnancy and the semen quality of their sons, conducted in five US cities from 1999 to 2005. Results indicated that higher maternal beef consumption was associated with lower sperm concentration and increased subfertility in sons. The findings suggest that xenobiotics in beef may impact testicular development and reproductive capacity.",
    "questions": [
      "Was the proportion of men with sperm concentration below 20 x 10^6/ml three times higher in sons of \"high beef consumers\"?",
      "Was sperm concentration 24.3% lower in sons of \"high beef consumers\"?",
      "Was sperm concentration inversely related to mothers' beef meals per week?",
      "Did the study report a P-value of 0.014 for the lower sperm concentration in sons of \"high beef consumers\"?",
      "Was a history of previous subfertility more frequent among sons of \"high beef consumers\"?",
      "Was sperm concentration not significantly related to the man's consumption of any meat?",
      "Was sperm concentration not significantly related to the mother's consumption of other meat?",
      "Did the study report a P-value of 0.015 for the increased subfertility in sons of \"high beef consumers\"?",
      "Did the study suggest that xenobiotics in beef may alter testicular development?",
      "Did the study find a P-value of 0.002 for the increased proportion of low sperm concentration in sons of \"high beef consumers\"?",
      "Did the study find a P-value of 0.041 for the relationship between sperm concentration and beef meals?",
      "Did the study conclude that maternal beef consumption may adversely affect reproductive capacity?",
      "Did the study find a threefold increase in low sperm concentration among sons of high beef consumers?",
      "Did the study involve analyzing the semen quality of men whose mothers consumed beef?",
      "Did the study use regression analyses to examine semen parameters?",
      "Was the study's focus on the potential long-term risks of beef consumption during pregnancy?",
      "Did the study find a significant relationship between maternal beef consumption and semen quality?",
      "Did the study find a significant impact of beef consumption on sperm concentration?",
      "Did the study find a significant relationship between beef consumption and semen quality?",
      "Was the study examining long-term risks from anabolic steroids in beef?",
      "Did the study find a significant inverse relationship between beef consumption and sperm concentration?",
      "Was the study conducted in five US cities?",
      "Was the semen quality of 387 men analyzed in the study?",
      "Did the study find no significant relationship between sperm concentration and other types of meat consumption?",
      "Did the study involve examining the potential risks of beef consumption during pregnancy?",
      "Did the study involve self-reported data from mothers about their beef consumption?",
      "Did the study find a significant relationship between maternal beef consumption and subfertility?",
      "Did the study analyze the semen quality of fertile US males?",
      "Did the study focus on the mothers' beef consumption during pregnancy?",
      "Was the study's methodology based on self-reported maternal beef consumption?"
    ]
  },
  "ground_truths_3215_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_3208_gen50_sel30_ceTrue": {
    "summary": "The study investigates the link between mercury levels in hair and subfertility among Hong Kong males, highlighting a positive correlation between mercury concentration and age. Subfertile males exhibited higher mercury levels compared to fertile males, while vegetarians showed significantly lower mercury concentrations. The study also notes that males generally had higher mercury levels than females.",
    "questions": [
      "Is the mercury concentration in the hair of subfertile Hong Kong males 4.5 ppm?",
      "Did subfertile males have approximately 40% more mercury in their hair than fertile males?",
      "Were hair samples collected from 16 vegetarians living in Hong Kong?",
      "Was the mercury level in fertile Hong Kong males found to be 3.9 ppm?",
      "Did the study include 117 subfertile Hong Kong males?",
      "Did the vegetarians consume no fish, shellfish, or meat for at least the last 5 years?",
      "Is the mercury concentration in Hong Kong males higher than in Finnish subjects?",
      "Is the mean hair mercury concentration of vegetarians 0.38 ppm?",
      "Are the mercury levels in subfertile males higher than in fertile males of similar age?",
      "Is the mercury concentration in hair higher in subfertile males than in fertile males?",
      "Are the mercury levels in Hong Kong males higher than those in European subjects?",
      "Is the focus of the study on the relationship between fish consumption and subfertility?",
      "Did the study find higher mercury levels in Hong Kong subjects compared to European subjects?",
      "Is mercury concentration in hair positively correlated with age according to the study?",
      "Does the study focus on Hong Kong male subfertility?",
      "Are the mercury levels in Hong Kong subjects higher than those in Finnish subjects?",
      "Is the study based on a sample size of 159 Hong Kong males?",
      "Is the mean age of the Hong Kong males in the study 37 years?",
      "Are the mercury levels in hair linked to subfertility in the study?",
      "Are vegetarians noted to have very low levels of mercury in their hair?",
      "Are the mercury levels in subfertile males statistically significant with P < 0.05?",
      "Are the mercury levels in males 60% higher than in females according to the study?",
      "Were there 42 fertile Hong Kong males included in the study?",
      "Does the study include subjects aged 25-72 years?",
      "Did females have significantly lower levels of hair mercury than males?",
      "Were only 35 female subjects included in the study?",
      "Are mercury levels in hair correlated with fish consumption in the study?",
      "Were 159 Hong Kong males included in the study?",
      "Does the study indicate a significant difference in mercury levels between subfertile and fertile males?",
      "Are the mercury levels in hair used to assess subfertility in the study?"
    ]
  },
  "ground_truths_3208_30": [
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1375_gen50_sel30_ceTrue": {
    "summary": "This study investigates the relationship between long-term statin use and the risk of ductal and lobular breast cancer among women aged 55-74 in the Seattle-Puget Sound region. It found that women who used statins for 10 years or longer had significantly increased risks of invasive ductal carcinoma (IDC) and invasive lobular carcinoma (ILC) compared to those who never used statins. The study suggests further research is needed to confirm these findings.",
    "questions": [
      "Among women with hypercholesterolemia, did statin users have more than double the risk of IDC?",
      "Among women with hypercholesterolemia, did statin users have more than double the risk of ILC?",
      "Did current statin users for 10 years or longer have a 1.83-fold increased risk of IDC?",
      "Did current statin users for 10 years or longer have a 1.97-fold increased risk of ILC?",
      "Did the study conclude that long-term statin use was associated with increased risks of IDC and ILC?",
      "Did the study find increased risks of both IDC and ILC among statin users?",
      "Was the study's confidence interval for IDC risk among statin users 1.14-2.93?",
      "Was the study's confidence interval for ILC risk among statin users 1.25-3.12?",
      "Did the study find that statin use increased breast cancer risk among women with hypercholesterolemia?",
      "Were the results of epidemiologic studies on statin use and breast cancer risk described as inconsistent?",
      "Did the study find increased breast cancer risk among statin users compared to never users?",
      "Were mechanistic studies largely supportive of statins' chemopreventive potential?",
      "Was the confidence interval for IDC risk among hypercholesterolemic women 1.17-3.57?",
      "Did the study lack the ability to evaluate long-term statin use?",
      "Were 1,068 cases of invasive lobular carcinoma (ILC) included in the study?",
      "Was the confidence interval for ILC risk among hypercholesterolemic women 1.40-4.21?",
      "Did the study investigate the relationship between statin use and breast cancer risk?",
      "Did the study find a 2.04 odds ratio for IDC among hypercholesterolemic statin users?",
      "Was the confidence interval for IDC risk 1.14-2.93?",
      "Did the study find a 2.43 odds ratio for ILC among hypercholesterolemic statin users?",
      "Was the confidence interval for ILC risk 1.25-3.12?",
      "Were 916 cases of invasive ductal carcinoma (IDC) included in the study?",
      "Was the odds ratio for IDC among hypercholesterolemic women 2.04?",
      "Was the odds ratio for ILC among hypercholesterolemic women 2.43?",
      "Did the study find a novel association between statin use and breast cancer risk?",
      "Was the study conducted in the Seattle-Puget Sound region?",
      "Was the study's impact described as needing additional studies with high frequencies of statin use?",
      "Was data on hypercholesterolemia collected through a structured questionnaire?",
      "Did the study involve collecting data on all episodes of lipid-lowering medication use?",
      "Was the increased risk of ILC among statin users statistically significant?"
    ]
  },
  "ground_truths_1375_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_570_gen50_sel30_ceTrue": {
    "summary": "The document discusses the mechanisms by which fatty acids induce insulin resistance in skeletal muscle, highlighting the role of mitochondrial dysfunction. It reviews evidence linking elevated plasma free fatty acids to insulin resistance and explores various mechanisms such as the Randle cycle, oxidative stress, and inflammation. An integrative model is proposed, positioning mitochondrial dysfunction as a central factor in these processes.",
    "questions": [
      "Are elevated plasma free fatty acid levels implicated in skeletal muscle insulin resistance?",
      "Is the Randle cycle mentioned as a mechanism for fatty acid-induced insulin resistance?",
      "Are physiological concentrations of saturated fatty acids linked to insulin resistance?",
      "Is inflammation considered a mechanism for fatty acid-induced insulin resistance?",
      "Are physiological concentrations of saturated fatty acids linked to insulin resistance in the document?",
      "Are the factors linking insulin resistance to syndromes precisely defined in the document?",
      "Does the document suggest mitochondrial dysfunction as a common factor in insulin resistance mechanisms?",
      "Is insulin resistance associated with the development of obesity?",
      "Is mitochondrial dysfunction proposed as a central factor in the integrative model?",
      "Are physiological concentrations of fatty acids discussed in relation to insulin resistance?",
      "Is the role of oxidative stress in insulin resistance supported by experimental evidence in the document?",
      "Does the document propose an integrative model involving mitochondrial dysfunction?",
      "Are saturated fatty acids associated with insulin resistance in the document?",
      "Is the development of insulin resistance associated with metabolic syndrome in the document?",
      "Are free fatty acids linked to insulin resistance in the document?",
      "Are in vivo studies mentioned in the context of skeletal muscle exposure to fatty acids?",
      "Does the document suggest that insulin resistance is linked to type 2 diabetes mellitus?",
      "Does the document mention experimental evidence supporting the proposed mechanisms?",
      "Does the document propose oxidative stress as a mechanism for insulin resistance?",
      "Does the document propose oxidative stress as a mechanism for insulin resistance?",
      "Does the document mention the involvement of the Randle cycle in insulin resistance?",
      "Does the document propose an integrative model for understanding insulin resistance?",
      "Is the Randle cycle one of the mechanisms reviewed in the document?",
      "Are elevated plasma free fatty acid levels considered important in the document?",
      "Is inflammation considered a mechanism for insulin resistance in the document?",
      "Is the development of skeletal muscle insulin resistance reviewed in the document?",
      "Is the role of inflammation in insulin resistance supported by evidence in the document?",
      "Does the document discuss the involvement of oxidative stress in insulin resistance?",
      "Does the document discuss the involvement of mitochondrial dysfunction in insulin resistance?",
      "Does the document mention the role of the Randle cycle in insulin resistance?"
    ]
  },
  "ground_truths_570_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_3211_gen50_sel30_ceTrue": {
    "summary": "The document discusses the controversy surrounding the timing of puberty onset in the USA, highlighting that traditional standards for diagnosing precocious puberty in girls may no longer be suitable. It notes that early maturing girls are more prone to obesity and that hyperinsulinaemia and insulin resistance may influence the onset of puberty. The document also suggests that this trend has not been observed in other countries but may spread with the adoption of American lifestyle and diet.",
    "questions": [
      "Are girls with premature pubarche more likely to develop functional ovarian hyperandrogenism?",
      "Are boys and girls with premature pubarche more hyperinsulinaemic than normal children?",
      "Are previously used standards for diagnosing precocious puberty in girls considered inappropriate in the USA?",
      "Are girls with premature pubarche more likely to develop adrenal hyperandrogenism?",
      "Does the document mention that early maturing girls are more likely to become obese in adolescence and adulthood?",
      "Does the document mention that early maturing girls are more likely to become obese than normal or late maturing girls?",
      "Does the document mention that early maturing girls are more likely to become obese than normal or late maturing girls?",
      "Is early menarche preceded by prepubertal hyperinsulinaemia?",
      "Is insulin resistance suggested to be more prevalent in US children than previously recognized?",
      "Has an advance in the timing of puberty onset been noted in other countries?",
      "Are early maturing white girls heavier at the onset of puberty compared to their peers?",
      "Has the timing of menarche changed significantly over the past few decades?",
      "Does the document mention that early maturing girls are more likely to become obese in adulthood?",
      "Does the document mention that early maturing white girls are heavier at puberty onset?",
      "Are early maturing girls more likely to become obese in adolescence?",
      "Do a significant number of girls show breast budding before 8 years of age?",
      "Is the document a review of possible causative factors for the advance in timing of puberty onset?",
      "Does the document propose that pubertal onset is influenced by hyperinsulinaemia?",
      "Does the document propose that pubertal onset is influenced by insulin resistance?",
      "Does the document suggest that insulin resistance may be more prevalent than recognized?",
      "Does the document mention that early maturing girls are more likely to become obese than their peers?",
      "Does the document propose that the tempo of puberty is influenced by hyperinsulinaemia?",
      "Does the document suggest that the American lifestyle may influence pubertal timing in other countries?",
      "Is the controversy about pubertal timing specific to the USA?",
      "Does the document propose a hypothesis regarding insulin resistance and pubertal onset?",
      "Does the document suggest that hyperinsulinaemia is a factor in early menarche?",
      "Is it suggested that other countries may experience similar trends with the adoption of an American lifestyle?",
      "Does the document suggest that the American lifestyle could influence pubertal timing globally?",
      "Is the document focused on the controversy surrounding pubertal timing?",
      "Is the same weight pattern at puberty onset observed in boys of either race?"
    ]
  },
  "ground_truths_3211_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No."
  ],
  "materials_v1.1_fewshot_3569_gen50_sel30_ceTrue": {
    "summary": "The Adventist Health Study-2 examined the relationship between various vegetarian diets and the incidence of diabetes among non-Black and Black participants. The study found that vegan, lacto ovo vegetarian, and semi-vegetarian diets were associated with a lower risk of diabetes compared to non-vegetarian diets, with the protective effect being significant in both non-Black and Black populations. The study highlighted that vegetarian diets offered substantial protection against diabetes, particularly among Black participants, where the protective effect was comparable to the increased risk associated with Black ethnicity.",
    "questions": [
      "Did the study conclude that vegetarian diets were associated with a substantial reduction in diabetes incidence?",
      "Were the associations between vegetarian diets and reduced diabetes risk strengthened when BMI was removed from the analyses?",
      "Did lacto ovo vegetarians have an odds ratio of 0.618 for reduced diabetes risk?",
      "Were lacto ovo vegetarian diets found to be protective against diabetes in both non-Blacks and Blacks?",
      "Did semi-vegetarians have a diabetes incidence rate of 0.92%?",
      "Did semi-vegetarian diets show a protective effect against diabetes in non-Blacks?",
      "Did lacto ovo vegetarians have a diabetes incidence rate of 1.08%?",
      "Did semi-vegetarians have an odds ratio of 0.486 for reduced diabetes risk?",
      "Did the study find that Blacks had an increased risk of diabetes compared to non-Blacks?",
      "Did the confidence interval for lacto ovo vegetarians among Blacks range from 0.270 to 0.825?",
      "Did vegans have an odds ratio of 0.381 for reduced diabetes risk?",
      "Did the confidence interval for lacto ovo vegetarians among non-Blacks range from 0.542 to 0.862?",
      "Was the study's aim to evaluate the relationship of diet to incident diabetes?",
      "Was the odds ratio for lacto ovo vegetarians among Blacks 0.472?",
      "Was the diabetes incidence rate for non-vegetarians 2.12%?",
      "Did the confidence interval for semi-vegetarians among non-Blacks range from 0.303 to 0.827?",
      "Was the diabetes incidence rate for pesco vegetarians 1.29%?",
      "Was the odds ratio for lacto ovo vegetarians among non-Blacks 0.684?",
      "Was the odds ratio for semi-vegetarians among non-Blacks 0.501?",
      "Was the odds ratio for vegans among non-Blacks 0.429?",
      "Was the odds ratio for increased diabetes risk among Blacks 1.364?",
      "Did the Adventist Health Study-2 include participants from both the U.S. and Canada?",
      "Was the incidence of diabetes among vegans 0.54%?",
      "Was the confidence interval for vegans' reduced risk between 0.236 and 0.617?",
      "Did the confidence interval for the increased risk among Blacks range from 1.093 to 1.702?",
      "Did the study have a follow-up questionnaire after two years?",
      "Was the odds ratio for vegans among Blacks 0.304?",
      "Did the study find protective effects of vegetarian diets among non-Blacks?",
      "Did the study find protective effects of vegetarian diets among Blacks?",
      "Were 26,187 women included in the study?"
    ]
  },
  "ground_truths_3569_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No",
    "No.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_53_gen50_sel30_ceTrue": {
    "summary": "The study assessed the impact of a dietary portfolio of cholesterol-lowering foods on LDL cholesterol levels in individuals with hyperlipidemia across four Canadian academic centers. Participants were randomized to receive either a control diet or a dietary portfolio with varying intensities of dietary advice over six months. Results showed that both dietary portfolio interventions significantly reduced LDL cholesterol compared to the control diet, with reductions linked to dietary adherence.",
    "questions": [
      "Did the intensive dietary portfolio have a confidence interval of -17.2% to -10.3% for LDL-C reduction?",
      "Did the intensive dietary portfolio result in a -13.8% reduction in LDL-C?",
      "Was the confidence interval for LDL-C reduction in the intensive dietary portfolio -31 to -21 mg/dL?",
      "Was the LDL-C reduction for the intensive dietary portfolio -26 mg/dL?",
      "Was the objective of the study to assess the effect of dietary portfolio on LDL-C percentage change?",
      "Did the dietary portfolio emphasize plant sterols, soy protein, viscous fibers, and nuts?",
      "Did the routine dietary portfolio result in a -13.1% reduction in LDL-C?",
      "Did the intensive dietary portfolio involve seven clinic visits over six months?",
      "Did the routine dietary portfolio involve two clinic visits over six months?",
      "Did the modified intention-to-treat analysis include 345 participants?",
      "Was the main outcome measure the percentage change in serum LDL-C?",
      "Were participants randomized between June 25, 2007, and February 19, 2009?",
      "Was the overall attrition rate significantly different between treatments?",
      "Did the P-value for LDL-C reduction comparison between dietary portfolios and control diet equal < .001?",
      "Was the confidence interval for the mean LDL-C level at baseline 168-174 mg/dL?",
      "Were the LDL-C reductions for the dietary portfolios significantly more than the control diet?",
      "Was the attrition rate 23% for the routine dietary portfolio?",
      "Did the study involve 351 participants with hyperlipidemia?",
      "Was the LDL-C reduction for the routine dietary portfolio -24 mg/dL?",
      "Did the study conclude that the dietary portfolio resulted in greater LDL-C lowering than the control diet?",
      "Was the confidence interval for LDL-C reduction in the routine dietary portfolio -30 to -19 mg/dL?",
      "Did the Fisher exact test yield a P-value of .33 for attrition rates?",
      "Was the study's context based on combining cholesterol-lowering foods?",
      "Was the study conducted in four academic centers across Canada?",
      "Was the attrition rate 18% for the intensive dietary portfolio?",
      "Did the two dietary portfolio interventions differ significantly in LDL-C reduction?",
      "Were the dietary portfolio interventions delivered at different frequencies?",
      "Was the attrition rate 26% for the control diet?",
      "Was the confidence interval for LDL-C reduction in the control diet -13 to -3 mg/dL?",
      "Did the routine dietary portfolio have a confidence interval of -16.7% to -9.5% for LDL-C reduction?"
    ]
  },
  "ground_truths_53_30": [
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No",
    "Yes.",
    "Yes.",
    "No.",
    "No."
  ],
  "materials_v1.1_fewshot_2051_gen50_sel30_ceTrue": {
    "summary": "A study in Japan investigated the impact of vegetable consumption on morning urinary 6-sulfatoxymelatonin concentrations among 94 healthy women aged 24-55. Participants in the intervention group consumed 350 g/day of six specific vegetables for 65 days, resulting in a significant increase in melatonin intake and altered 6-sulfatoxymelatonin concentrations compared to the control group. The findings suggest that increased vegetable consumption can elevate circulatory melatonin levels.",
    "questions": [
      "Did the mean concentration of 6-sulfatoxymelatonin in the intervention group change from 48.1 ng/mg creatinine to 49.6 ng/mg creatinine?",
      "Did the mean concentration of 6-sulfatoxymelatonin in the control group change from 55.5 ng/mg creatinine to 50.8 ng/mg creatinine?",
      "Did the intervention group have a daily mean melatonin intake of 1288.0 ng from the vegetables?",
      "Was the 95% confidence interval for the final 6-sulfatoxymelatonin concentration in the intervention group 42.8-57.3 ng/mg creatinine?",
      "Was the 95% confidence interval for the final 6-sulfatoxymelatonin concentration in the control group 44.0-58.7 ng/mg creatinine?",
      "Was the 95% confidence interval for the initial 6-sulfatoxymelatonin concentration in the intervention group 40.4-57.2 ng/mg creatinine?",
      "Was the 95% confidence interval for the initial 6-sulfatoxymelatonin concentration in the control group 48.7-63.2 ng/mg creatinine?",
      "Did the study conclude that increased vegetable consumption raises circulatory melatonin concentrations?",
      "Was first-void morning urine collected before and at the end of the intervention period?",
      "Did the control group have a daily mean melatonin intake of 5.3 ng from the vegetables?",
      "Did the study find that vegetable consumption affects melatonin levels?",
      "Was there a significant difference in the changes of 6-sulfatoxymelatonin concentrations between the two groups?",
      "Did the intervention group consume high amounts of six selected vegetables?",
      "Was the P-value for the comparison of changes in 6-sulfatoxymelatonin concentrations between the groups 0.03?",
      "Was the study focused on the effects of vegetable consumption on melatonin levels?",
      "Were participants in the control group asked to avoid the six selected vegetables?",
      "Was the target vegetable consumption set at 350 g/day for the intervention group?",
      "Were creatinine-adjusted 6-sulfatoxymelatonin concentrations measured?",
      "Was the study's conclusion related to melatonin and vegetable consumption?",
      "Did the study involve a public health center in Japan?",
      "Was the recruitment of participants done through a city public health center?",
      "Did the study find a significant difference in melatonin levels between the intervention and control groups?",
      "Did the study measure melatonin intake from vegetables?",
      "Was the study's control group asked to avoid certain vegetables?",
      "Did the intervention group show an increase in 6-sulfatoxymelatonin concentration?",
      "Did the study involve 94 healthy women?",
      "Was the creatinine adjustment used in measuring 6-sulfatoxymelatonin concentrations?",
      "Was the study's intervention group required to consume vegetables?",
      "Were the participants randomly allocated to intervention and control groups?",
      "Did the study measure melatonin concentrations in urine?"
    ]
  },
  "ground_truths_2051_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes"
  ],
  "materials_v1.1_fewshot_1982_gen50_sel30_ceTrue": {
    "summary": "The study investigates the antigenotoxic properties of watercress extract using an in vitro mammalian system with a comet assay. Two concentrations of the extract were tested, showing significant reductions in oxidative DNA damage, suggesting watercress as a beneficial dietary component for health improvement.",
    "questions": [
      "Are the antigenotoxic properties of watercress extract tested against induced oxidative damage?",
      "Is the study's aim to determine the impact of watercress extract on cell viability?",
      "Is the study suggesting watercress as a powerful tool for improving health?",
      "Does the document mention the percentage reductions in damage being similar between the two concentrations?",
      "Does oxidative DNA damage play a role in chronic, aging-related diseases as per the document?",
      "Was the p-value 0.005 at 30 minutes for the damage index?",
      "Were significant antigenotoxic effects observed at both concentrations?",
      "Was the watercress extract prepared using a juice processor?",
      "Was the p-value less than 0.001 at 60 and 90 minutes for the damage index?",
      "Is the study focused on the antigenotoxic activity of watercress extract?",
      "Does the document mention watercress being used in the treatment of several diseases?",
      "Was the aqueous extract of watercress leaves centrifuged during preparation?",
      "Does the document suggest watercress consumption improves health and quality of life?",
      "Was the aqueous extract of watercress leaves filtered during preparation?",
      "Was the extract preserved at -20C?",
      "Does the document mention the impact of watercress extract on cell viability?",
      "Did the percentage reduction in damage range from 67.1% to 75.2%?",
      "Is oxidative DNA damage considered probably carcinogenic according to the document?",
      "Did the study find no differences in cell viability between control and treated groups?",
      "Does the document mention the use of a juice processor, centrifuge, and filter in extract preparation?",
      "Is one of the concentrations of the extract 13.2 mg/mL?",
      "Is the other concentration of the extract 26.4 mg/mL?",
      "Were peripheral blood cells used as the in vitro model in the study?",
      "Is watercress part of Mediterranean diets according to the document?",
      "Does the document state that no differences were found in cell viability at any time?",
      "Is watercress referred to as a nutritive food in the document?",
      "Is the copyright of the document held by John Wiley & Sons, Ltd.?",
      "Are the antigenotoxic effects expressed as the damage index in the study?",
      "Is the study's focus on the potential health benefits of watercress?",
      "Were two concentrations of the extract tested in the study?"
    ]
  },
  "ground_truths_1982_30": [
    "Yes.",
    "No",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_2801_gen50_sel30_ceTrue": {
    "summary": "A cohort study investigated the risk of esophageal carcinoma among workers with long-term exposure to sodium nitrite at a wood screw manufacturer from 1977 to 2000. The study found a significantly increased risk of esophageal carcinoma in the exposed group compared to a control group, with 11 cases of esophageal carcinoma documented over 30 years. The study highlights the dangers of sodium nitrite exposure, particularly in occupational settings lacking protective measures.",
    "questions": [
      "Did the study conclude that long-term exposure to sodium nitrite increases esophageal carcinoma risk?",
      "Was the average exposure time to sodium nitrite in the study group 22.1 years?",
      "Was the cohort study focused on esophageal carcinoma risk due to sodium nitrite exposure?",
      "Was the relative risk for esophageal carcinoma in the study group 1.26?",
      "Was sodium nitrite used as an anticorrosive and coolant fluid in the production process?",
      "Did the study find a marked increase in esophageal carcinoma risk due to sodium nitrite?",
      "Was the 95% confidence interval for the relative risk 1.08-1.46?",
      "Was the incidence of esophageal carcinoma followed until the end of 2007?",
      "Did the sodium nitrite exposure time range from 16 to 23 years?",
      "Were 11 cases of esophageal carcinoma documented in the study group?",
      "Was the study's cohort exposed to sodium nitrite occupationally?",
      "Was the study's cohort exposed to sodium nitrite for an average of over 20 years?",
      "Was the study group compared to a control group without direct sodium nitrite exposure?",
      "Was the study's objective to investigate esophageal carcinoma risk?",
      "Were 10 other malignant tumors documented in the study group?",
      "Were 160 workers directly exposed to sodium nitrite in the study group?",
      "Was the study group exposed to sodium nitrite due to lack of protective measures?",
      "Was the wood screw manufacturer founded in 1977?",
      "Was the exposure to sodium nitrite through skin, mouth, and airway?",
      "Did the study find a significant increase in esophageal carcinoma risk in the study group?",
      "Were other malignant tumors besides esophageal carcinoma followed in the study?",
      "Was the chi-square value 116.83?",
      "Was the study's cohort exposed to sodium nitrite through multiple routes?",
      "Did the manufacturer close down in 2000?",
      "Did the study include diagnosis and treatment of esophageal carcinoma?",
      "Did the study involve workers from turning and milling shops?",
      "Did the study group have direct contact with sodium nitrite?",
      "Was the study associated with the International Society for Diseases of the Esophagus?",
      "Were there 4 cases of hepatic cell carcinoma in the study group?",
      "Did the study highlight the dangers of sodium nitrite exposure in occupational settings?"
    ]
  },
  "ground_truths_2801_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_2853_gen50_sel30_ceTrue": {
    "summary": "This review examines the role of natural products in drug development over the past 25 years, updating previous reviews from 1997 and 2003. It highlights the significant contribution of natural products to antitumor and antiinfective drugs, noting that 73% of small molecules in cancer treatment are derived from natural sources. The review also emphasizes the importance of microbial interactions in the production of natural product drugs.",
    "questions": [
      "Is there only one de novo combinatorial compound approved as a drug in the 25 plus year time frame discussed?",
      "Are natural products described as sources of novel structures but not necessarily the final drug entity?",
      "Does the review cover a time frame from January 1981 to June 2006 for all diseases worldwide?",
      "Does the review extend the time frame for approved antitumor drugs from 1950 to June 2006?",
      "Are 73% of the 155 small molecules in cancer treatment derived from sources other than synthetic?",
      "Is the review an updated and expanded version of two prior reviews?",
      "Does the review state that 47% of cancer treatment molecules are natural products or directly derived from them?",
      "Was this review published in the same journal as the previous reviews from 1997 and 2003?",
      "Does the review mention the rapidly evolving recognition of microbial contributions to natural product drugs?",
      "Is the antiinfective area described as being dependent on natural products and their structures?",
      "Does the review cover the time frame from 1950 to 2006 for antitumor drugs?",
      "Does the review cover all approved agents for diseases worldwide from 1981 to 2006?",
      "Does the review cover the influence of natural product structures in areas other than cancer and antiinfective treatments?",
      "Does the review discuss the role of natural products in drug development over the last 25 years?",
      "Does the review discuss the role of natural products in drug development over the last 25 years?",
      "Is the review an expanded version of prior reviews published in the same journal?",
      "Are microbial interactions with the host considered significant in the production of natural product drugs?",
      "Is the review based on data from previous reviews published in 1997 and 2003?",
      "Does the review claim that natural products are still a viable source of novel drug structures?",
      "Are natural products described as sources of novel drug structures in the review?",
      "Is the review an updated version of prior reviews published in the same journal?",
      "Is the concept of \"natural product mimic\" or \"NM\" used in this review?",
      "Is the review based on data presented in previous reviews from 1997 and 2003?",
      "Are natural products considered alive and well as sources of novel drug structures?",
      "Are natural product drugs/leads described as being produced by microbes?",
      "Does the review mention the success of combinatorial chemistry techniques in optimizing drug structures?",
      "Does the review cover the time frame from around the 1940s to the present for cancer treatment molecules?",
      "Are natural product mimics included in the review's subdivisions?",
      "Does the review suggest expanding research into natural product drugs produced by microbes?",
      "Does the review cover the influence of natural product structures in drug development?"
    ]
  },
  "ground_truths_2853_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1086_gen50_sel30_ceTrue": {
    "summary": "This study evaluated the antithrombotic activity of extracts from fruits and vegetables commonly consumed in central Chile, focusing on their antiplatelet, anticoagulant, and fibrinolytic properties. Green beans and tomatoes showed antiplatelet activity, grapes exhibited anticoagulant effects, and raspberries demonstrated both anticoagulant and fibrinolytic activities.",
    "questions": [
      "Were tomatoes found to inhibit platelet aggregation induced by arachidonic acid?",
      "Did extracts of green beans inhibit platelet aggregation induced by ADP?",
      "Was the aim of the study to assess antithrombotic activity of fruits and vegetables?",
      "Was the aim of the study to assess antithrombotic activity of fruits and vegetables?",
      "Was the study conducted on fruits and vegetables widely consumed in central Chile?",
      "Did the study find scarce information on antithrombotic activity of fruits and vegetables?",
      "Did the study find scarce information on antithrombotic activity of fruits and vegetables?",
      "Were green beans and tomatoes tested for antiplatelet activity?",
      "Were raspberries tested for both anticoagulant and fibrinolytic activities?",
      "Did raspberry extracts prolong the activated partial thromboplastin time (APTT)?",
      "Was fibrinolytic activity observed only in raspberries?",
      "Was fibrinolytic activity observed only in raspberries?",
      "Did the study find that grapes prolonged the PT and dPT?",
      "Did the methanolic extracts of grapes prolong the prothrombin time (PT)?",
      "Did the study determine fibrinolytic effect using euglobin clot lysis time?",
      "Was fibrinolytic activity observed in raspberry extracts?",
      "Were raspberry extracts found to have fibrinolytic activity?",
      "Were the extracts prepared using aqueous and/or methanol-soluble fractions?",
      "Did the study assess antiplatelet activity by platelet aggregation inhibition?",
      "Were tomatoes found to have antiplatelet activity?",
      "Were tomatoes found to have antiplatelet activity?",
      "Was the diluted prothrombin time (dPT) prolonged by grape extracts?",
      "Did the study conclude that green beans have antiplatelet activity?",
      "Did the study find antiplatelet activity in green beans?",
      "Was anticoagulant activity measured by prothrombin time (PT)?",
      "Did the study include samples from 19 fruits?",
      "Was the final concentration of extracts used in the study 1 mg/ml?",
      "Did the study use diluted prothrombin time (dPT) to measure anticoagulant activity?",
      "Was activated partial thromboplastin time (APTT) used in the study?",
      "Was arachidonic acid used to induce platelet aggregation?"
    ]
  },
  "ground_truths_1086_30": [
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1060_gen50_sel30_ceTrue": {
    "summary": "The study investigated the causes of recurrent perianal dermatitis in infants, identifying cow's milk allergy (CMA) as a significant contributor, accounting for 47.6% of cases. Diagnosis involved various clinical and laboratory methods, including serum IgE concentration and an open withdrawal-rechallenge procedure. Predictors of CMA included symptoms like bloody or mucoid stool, anal fissures, vomiting, and other atopic manifestations.",
    "questions": [
      "Is cow's milk allergy concluded to be a common cause of recurrent perianal dermatitis?",
      "Did the study find that cow's milk allergy is a major contributor to perianal dermatitis?",
      "Was the study's aim to assess cow's milk allergy as a cause of perianal dermatitis?",
      "Did the study aim to assess the magnitude of cow's milk allergy as a cause?",
      "Was cow's milk allergy identified as a cause in 47.6% of cases?",
      "Was the study's aim to assess the magnitude of cow's milk allergy?",
      "Was CMA confirmed through an open withdrawal-rechallenge procedure?",
      "Was the study conducted on 63 infants with perianal dermatitis?",
      "Was a perianal swab used for different cultures and staining for Candida albicans?",
      "Did the study conclude that mucoid or bloody stool can predict CMA?",
      "Were bloody and/or mucoid stools predictors of CMA?",
      "Were serum immunoglobulins and CD markers assessed for some patients?",
      "Was bacterial dermatitis identified as a cause in 17.46% of cases?",
      "Did the study identify lactose intolerance as a cause of perianal dermatitis?",
      "Did the infants have perianal dermatitis for more than 3 weeks?",
      "Was the study focused on infants with a history of recurrence of perianal dermatitis?",
      "Was the study conducted on infants with recurrent perianal dermatitis?",
      "Did moniliasis account for 15.87% of the perianal dermatitis cases?",
      "Was quantitative determination of cow's milk-specific serum IgE concentration performed?",
      "Was recurrent vomiting a predictor of CMA?",
      "Was the study's conclusion based on the presence of recurrent vomiting?",
      "Was enterobiasis responsible for 9.52% of the cases?",
      "Was the presence of anal ulcers mentioned as a predictor of CMA?",
      "Was the study's conclusion based on the presence of bloody stool?",
      "Did the study involve gastrointestinal endoscopies for some patients?",
      "Were other atopic manifestations considered predictors of CMA?",
      "Did the study identify predictors of cow's milk allergy?",
      "Did the study identify bacterial dermatitis as a cause of perianal dermatitis?",
      "Did lactose intolerance contribute to 9.5% of the cases?",
      "Did the study identify enterobiasis as a cause of perianal dermatitis?"
    ]
  },
  "ground_truths_1060_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1822_gen50_sel30_ceTrue": {
    "summary": "Recent studies indicate that neurocysticercosis may contribute to oncogenesis through mechanisms such as immune modulation, genetic material transfer, and chronic inflammation. These processes potentially lead to DNA damage and the inhibition of tumor suppressor genes, necessitating further research to confirm the role of cysticercosis in cancer development.",
    "questions": [
      "Does the document discuss the pathogenetic mechanisms explaining oncogenic effects of cysticerci?",
      "Does the document suggest that further research should confirm the role of cysticercosis in cancer?",
      "Are inflammatory cells releasing nitric oxide mentioned as causing DNA damage?",
      "Is the role of cysticercosis in cancer development described as needing confirmation?",
      "Is the transfer of genetic material from parasite to host described as causing malignant transformation?",
      "Is the transfer of genetic material from parasite to host described as causing malignant transformation?",
      "Is the modulation of the host immune response associated with loss of regulatory mechanisms?",
      "Is the modulation of the host immune response associated with loss of regulatory mechanisms?",
      "Is the transfer of genetic material from the parasite to the host associated with DNA damage?",
      "Does the document suggest that further research should determine the presence of cysticercotic factors?",
      "Is the liberation of nitric oxide associated with inhibition of tumor suppressor genes?",
      "Does the document suggest that neurocysticercosis may lead to malignant transformation of host cells?",
      "Does the document suggest neurocysticercosis as a risk factor for human cancer?",
      "Is the transfer of genetic material from parasite to host associated with DNA damage?",
      "Does the document call for further research to confirm the role of cysticercosis in cancer?",
      "Does the document suggest investigating the presence of cysticercotic factors responsible for genetic material transfer?",
      "Does the document suggest investigating the presence of cysticercotic factors responsible for genetic material transfer?",
      "Is the modulation of the host immune response linked to loss of regulatory mechanisms?",
      "Are astrocytes mentioned in the context of surrounding cysticercotic lesions?",
      "Is the liberation of nitric oxide mentioned as inhibiting tumor suppressor genes?",
      "Does the document suggest that neurocysticercosis may lead to cancer through immune modulation?",
      "Are proliferating astrocytes mentioned in relation to potential mutations in tumor suppressor genes?",
      "Does the document mention the need to investigate the presence of inflammatory cells releasing nitric oxide?",
      "Is the liberation of nitric oxide associated with chronic inflammation in the document?",
      "Are tumor suppressor genes mentioned as being inhibited by chronic inflammation?",
      "Are tumor suppressor genes mentioned as being inhibited by chronic inflammation?",
      "Are tumor suppressive mechanisms mentioned as being impaired by nitric oxide?",
      "Is modulation of the host immune response mentioned as a pathogenetic mechanism?",
      "Are proliferating astrocytes mentioned in the context of cysticercotic lesions?",
      "Are proliferating astrocytes mentioned in the context of cysticercotic lesions?"
    ]
  },
  "ground_truths_1822_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_2992_gen50_sel30_ceTrue": {
    "summary": "A study investigated the effects of different dietary fats on postprandial inflammatory responses in healthy men, focusing on proinflammatory gene expression in peripheral blood mononuclear cells (PBMCs). The results showed that a butter breakfast led to higher expression of proinflammatory cytokines compared to olive oil and walnut breakfasts, although plasma concentrations of these parameters did not differ significantly.",
    "questions": [
      "Did the study find a higher postprandial response in IL-6 mRNA with butter and olive oil breakfasts?",
      "Was interleukin-6 mRNA expression higher after butter and olive oil breakfasts compared to the walnut breakfast?",
      "Was tumor necrosis factor-alpha mRNA expression higher after the butter breakfast compared to olive oil or walnut breakfasts?",
      "Was the butter breakfast associated with a higher postprandial inflammatory response than the olive oil breakfast?",
      "Did the butter breakfast result in a higher increase in TNF-alpha mRNA expression with a P-value of 0.014?",
      "Was the objective of the study to evaluate dietary fat effects on postprandial proinflammatory gene expression?",
      "Was the Western diet composed of 15% protein, 47% carbohydrates, and 38% fat?",
      "Did the study find that walnut breakfasts resulted in lower IL-6 mRNA expression compared to butter breakfasts?",
      "Was the olive oil breakfast associated with lower TNF-alpha mRNA expression than the butter breakfast?",
      "Did the study find no significant differences in plasma concentrations of proinflammatory parameters with a P-value labeled as N.S.?",
      "Was the olive oil breakfast composed of 36% monounsaturated fatty acids?",
      "Did the study focus on the chronic effects of dietary fat on proinflammatory gene expression?",
      "Did the study find a P-value of 0.025 for IL-6 mRNA expression differences between breakfasts?",
      "Did the study conclude that butter-enriched meals elicit greater postprandial expression of proinflammatory cytokine mRNA in PBMCs?",
      "Did the walnut breakfast contain 16% polyunsaturated fatty acids?",
      "Did the study conclude that butter breakfasts increase proinflammatory cytokine mRNA expression?",
      "Was alpha-linolenic acid present at 4% in the walnut breakfast?",
      "Was the CHO-rich and n-3 diet composed of 55% carbohydrates?",
      "Did the study involve a comparison between butter, olive oil, and walnut breakfasts?",
      "Was the CHO-rich and n-3 diet composed of less than 30% fat?",
      "Did the Mediterranean diet contain 24% monounsaturated fatty acids?",
      "Was the study's conclusion related to butter-enriched meals and inflammation?",
      "Was the postprandial inflammatory response measured after breakfast consumption?",
      "Were plasma concentrations of proinflammatory parameters significantly different between the breakfasts?",
      "Was the study's focus on dietary fat's chronic effects on inflammation?",
      "Did the study involve dietary fat's effect on inflammation markers?",
      "Did the butter breakfast contain 35% saturated fatty acids?",
      "Was inflammation considered crucial in all stages of atherosclerosis according to the document?",
      "Did the Mediterranean diet consist of 47% carbohydrates?",
      "Did the study find significant differences in mRNA expression between breakfasts?"
    ]
  },
  "ground_truths_2992_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1168_gen50_sel30_ceTrue": {
    "summary": "Beta-carbolines norharman and harman are implicated in various diseases and are formed endogenously, with external sources such as fried meats, alcoholic drinks, and tobacco smoke contributing to exposure. Estimated exposure levels vary by source, with tobacco smoke being a significant contributor, and studies indicate high bioavailability through inhalation and potential increased uptake via sublingual absorption.",
    "questions": [
      "Are there indications that sublingual absorption may increase dietary uptake of beta-carbolines?",
      "Can endogenous formation of norharman be estimated to 50-100 ng/kg bw per day?",
      "Does inhalative exposure lead to high bioavailability of norharman and harman?",
      "Is the maximum estimated exposure level for norharman from dietary sources 4 microg/kg bw per day?",
      "Is the estimated exposure from tobacco smoke 1.1 microg/kg bw for norharman per package of cigarettes smoked?",
      "Is the estimated exposure from tobacco smoke 0.6 microg/kg bw for harman per package of cigarettes smoked?",
      "Is the endogenous formation of norharman estimated to be 50-100 ng/kg bw per day?",
      "Can exposure levels from dietary sources reach up to 4 microg norharman per kg body weight per day?",
      "Does inhalative exposure lead to rapid increase in plasma levels of beta-carbolines?",
      "Do studies on toxicokinetics indicate rapid increase in plasma levels from inhalative exposure?",
      "Is the maximum estimated exposure level for harman from dietary sources 1 microg/kg bw per day?",
      "Is the endogenous formation of harman estimated to be about 20 ng/kg bw per day?",
      "Is the estimated exposure level for harman from dietary sources 1 microg per kg body weight per day?",
      "Is endogenous formation of harman estimated to about 20 ng/kg bw per day?",
      "Are elevated plasma levels of harman reported following consumption of beta-carboline-containing food?",
      "Is cigarette smoking identified as a major influence on beta-carboline exposure?",
      "Is oral bioavailability of norharman and harman lower than inhalative bioavailability?",
      "Is tobacco smoke identified as a major source of norharman and harman?",
      "Have biomarker studies reported elevated levels of norharman in diseased patients?",
      "Have norharman and harman been implicated in Parkinson's disease?",
      "Is sublingual absorption mentioned as a potential method to increase dietary uptake of beta-carbolines?",
      "Are fried meat and fish identified as sources of norharman and harman?",
      "Are elevated plasma levels of norharman reported following tobacco smoking?",
      "Is sublingual absorption a method to increase dietary uptake of beta-carbolines?",
      "Is cigarette smoking a major influence on plasma levels of beta-carbolines?",
      "Are edible and medicinal plants identified as sources of norharman and harman?",
      "Can dietary exposure contribute to beta-carboline exposure?",
      "Is the endogenous formation of norharman estimated to be higher than that of harman?",
      "Do endogenous formation rates increase with high intake of precursors?",
      "Are meat extracts listed as sources of norharman and harman?"
    ]
  },
  "ground_truths_1168_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_960_gen50_sel30_ceTrue": {
    "summary": "This study investigates the impact of childhood exposure to violence on telomere erosion between ages 5 and 10. It found that children exposed to multiple types of violence, such as domestic violence, bullying, and physical maltreatment, experienced accelerated telomere erosion compared to their peers. The research highlights a potential mechanism linking early-life stress to cellular aging and long-term health consequences.",
    "questions": [
      "Was the study interested in mechanisms mediating the effects of childhood stress on late-life disease morbidity and mortality?",
      "Was the hypothesis tested that childhood violence exposure accelerates telomere erosion?",
      "Was telomere erosion found to be significantly greater in children exposed to two or more types of violence?",
      "Did the study find that children exposed to violence showed more telomere erosion compared to their counterparts?",
      "Did the study provide support for a mechanism linking cumulative childhood stress to telomere maintenance?",
      "Was the mean relative telomere length measured simultaneously in baseline and follow-up DNA samples?",
      "Did the study measure telomere erosion in relation to childrens exposure to violence?",
      "Were the participants recruited from a nationally representative 19941995 birth cohort?",
      "Was telomere erosion measured using the quantitative PCR method for T/S ratio?",
      "Did the study suggest telomere erosion as a mechanism linking stress to cellular aging?",
      "Did the study examine the effects of childhood exposure to violence on telomere erosion?",
      "Was the study conducted with repeated telomere measurements while children experienced stress?",
      "Was the study described as the first prospective-longitudinal study with repeated telomere measurements in children?",
      "Did the study assess violence exposure as maternal domestic violence, bullying victimization, and physical maltreatment by an adult?",
      "Did the study find that telomere erosion is linked to cumulative childhood stress?",
      "Was the study interested in discovering mechanisms that mediate the effects of childhood stress?",
      "Did the study find that telomere erosion was observed already at a young age?",
      "Was the study focused on telomere erosion in children aged 5 to 10 years?",
      "Did 42% of the participants have one or more violence exposures?",
      "Did the study find that telomere erosion is a potential mechanism linking stress to health outcomes?",
      "Was the study conducted with a focus on the effects of childhood stress on telomere erosion?",
      "Did the study find that telomere erosion has potential impacts for life-long health?",
      "Did the study find that telomere erosion is observed at a young age?",
      "Did the study find that telomere erosion is linked to disease and mortality in humans?",
      "Did the study find that exposure to violence is a major public-health and social-welfare problem?",
      "Did the study include 236 children as participants?",
      "Did the study find that telomere erosion is linked to cellular aging?",
      "Did the study find potential impacts of telomere erosion on life-long health?",
      "Did the study find long-term consequences for well-being due to exposure to violence?",
      "Did the study find that telomere erosion is linked to stress?"
    ]
  },
  "ground_truths_960_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "I don't know",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1863_gen50_sel30_ceTrue": {
    "summary": "The modern Western diet, characterized by low fruit and vegetable intake and high animal product consumption, leads to diet-induced metabolic acidosis, exacerbated by aging and declining kidney function. This condition triggers compensatory kidney mechanisms, altering urine composition and increasing risks for stone formation and metabolic disorders, including insulin resistance and cardiovascular issues.",
    "questions": [
      "Do recent observational studies confirm an association between insulin resistance and metabolic acidosis markers?",
      "Are hypocitraturia and hypercalciuria risk factors for calcium stone disease?",
      "Does metabolic acidosis induce skeletal muscle resistance to insulin action?",
      "Is high dietary acid load more likely to result in diabetes?",
      "Does the kidney implement compensating mechanisms to restore acid-base balance?",
      "Is low urine pH a predisposition for uric acid stone formation?",
      "Is metabolic acidosis associated with the accumulation of non-metabolizable anions?",
      "Are diabetes and chronic kidney failure patient populations affected by dietary acid load?",
      "Is dietary acid load a predictor of metabolic abnormalities?",
      "Can high dietary acid load lead to systemic hypertension?",
      "Is low urine pH a marker of metabolic acidosis?",
      "Are non-metabolizable anions removed by the kidney as a compensatory mechanism?",
      "Does the kidney conserve citrate in response to metabolic acidosis?",
      "Is low serum bicarbonate a marker of metabolic acidosis?",
      "Does the document mention the association between insulin resistance and low urine pH?",
      "Does the magnitude of metabolic acidosis increase with aging?",
      "Does metabolic acidosis lower urine pH?",
      "Does the document mention systemic hypertension as a result of high dietary acid load?",
      "Are overweight and obese individuals at higher risk due to dietary acid load?",
      "Is kidney ammoniagenesis enhanced due to metabolic acidosis?",
      "Can dietary acid load increase cardiovascular risk?",
      "Does the document mention the association between insulin resistance and low serum bicarbonate?",
      "Is high serum anion gap associated with metabolic acidosis?",
      "Does the document mention the association between insulin resistance and high serum anion gap?",
      "Is the physiological decline in kidney function a factor in worsening metabolic acidosis?",
      "Is hypercalciuria mentioned as a risk factor for stone disease in the document?",
      "Does metabolic acidosis lead to increased urinary excretion of ammonium ions?",
      "Is hypocitraturia a marker of metabolic acidosis?",
      "Are metabolic abnormalities linked to dietary acid load in the document?",
      "Is the enhancement of kidney ammoniagenesis a compensatory mechanism mentioned in the document?"
    ]
  },
  "ground_truths_1863_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1112_gen50_sel30_ceTrue": {
    "summary": "The document discusses how evidence-based medicine biases physicians against nutrition by emphasizing double-blind, randomized controlled trials, which are not feasible for dietary interventions. This bias leads medical students in the United States to favor drug treatments over dietary approaches for managing chronic diseases.",
    "questions": [
      "Are physicians encouraged to ignore information not from double-blind, randomized controlled trials?",
      "Are medical students in the United States taught little about nutrition and dietetics?",
      "Are physicians described as biased due to their training in evidence-based medicine?",
      "Is the bias against dietary interventions described as a result of evidence-based medicine?",
      "Are physicians described as being biased against dietary interventions?",
      "Is the current approach to evidence-based medicine focused on double-blind, randomized controlled trials?",
      "Is the bias against dietary interventions specifically related to the management of chronic disease?",
      "Does the document claim that evidence-based medicine biases physicians against nutrition?",
      "Can human beings be blinded to a dietary intervention according to the document?",
      "Is the bias against nutrition linked to the methodology of evidence-based medicine?",
      "Are human beings described as unable to be blinded to dietary interventions?",
      "Is the bias against nutrition described as a result of medical training?",
      "Are medical students described as biased against nutrition?",
      "Are physicians described as ignoring non-double-blind trial information?",
      "Does the document suggest that physicians are biased toward drug treatments?",
      "Are dietary interventions mentioned as a method for managing chronic disease?",
      "Is the bias against nutrition linked to the preference for drug treatments?",
      "Are dietary interventions described as a viable option for managing chronic disease?",
      "Are dietary interventions considered less credible due to the lack of double-blind trials?",
      "Does the document imply that dietary interventions cannot be tested in a double-blind manner?",
      "Does the document mention that dietary approaches have the power to manage disease?",
      "Are drug treatments described as being preferred over dietary interventions?",
      "Are drug treatments described as being favored over dietary approaches?",
      "Does the document mention the power of dietary approaches in managing disease?",
      "Does the document suggest that dietary interventions are powerful in managing disease?",
      "Does the document imply that physicians favor drug treatments over dietary interventions?",
      "Does the document discuss the impact of evidence-based medicine on dietary interventions?",
      "Does the document imply that dietary interventions are effective in disease management?",
      "Is the copyright year of the document 2013?",
      "Does the document imply that evidence-based medicine is flawed in its approach to nutrition?"
    ]
  },
  "ground_truths_1112_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_2605_gen50_sel30_ceTrue": {
    "summary": "The study investigates the relationship between insulin-like growth factor 1 (IGF1) and breast cancer risk, using data from 17 prospective studies across 12 countries. It finds that higher IGF1 concentrations are positively associated with breast cancer risk, particularly for oestrogen-receptor-positive tumors, and this association is not significantly modified by IGF binding protein 3 (IGFBP3) or menopausal status.",
    "questions": [
      "Was the OR for breast cancer for women in the highest versus the lowest fifth of IGF1 concentration 1.28?",
      "Was the OR for breast cancer for women in the highest versus the lowest fifth of IGF1 concentration 1.28?",
      "Was the association between IGF1 and breast cancer risk not altered by adjusting for IGFBP3?",
      "Did the association between IGF1 and breast cancer risk vary significantly by menopausal status at blood collection?",
      "Was the relationship between IGF1 and breast cancer risk modified by IGF binding protein 3 (IGFBP3)?",
      "Did adjusting for IGFBP3 alter the association between IGF1 and breast cancer risk?",
      "Was the association between IGF1 and breast cancer risk not substantially modified by IGFBP3?",
      "Did the study estimate odds ratios (ORs) for breast cancer associated with increasing IGF1 concentrations?",
      "Was the association between IGF1 and breast cancer risk substantially modified by IGFBP3?",
      "Did the study find that the association between IGF1 and breast cancer risk does not differ markedly by menopausal status?",
      "Did the study find that the association between IGF1 and breast cancer risk does not differ markedly by menopausal status?",
      "Did the study find that IGF1 concentrations were higher in moderate alcohol consumers than in other women?",
      "Were geometric mean concentrations calculated for IGF1 in categories of breast cancer risk factors?",
      "Did the study find a consistent association between circulating IGF1 and breast cancer risk?",
      "Did the study find that circulating IGF1 is positively associated with breast cancer risk?",
      "Were 4790 cases and 9428 matched controls included in the analysis?",
      "Is IGF1 known to stimulate mitosis and inhibit apoptosis?",
      "Did the study find IGF1 concentrations higher in moderately overweight women than in other women?",
      "Is circulating IGF1 positively associated with breast cancer risk according to the study?",
      "Did the study find that IGF1 concentrations were inversely associated with age at menarche?",
      "Did the study find that IGF1 concentrations were inversely associated with years since menopause?",
      "Did the study use individual data on prediagnostic IGF1 and IGFBP3 concentrations?",
      "Did the study find that IGF1 concentrations were positively associated with height?",
      "Was the p value for the association between IGF1 and breast cancer risk less than 0.0001?",
      "Did moderate alcohol consumers have higher IGF1 concentrations than other women?",
      "Were IGF1 concentrations higher in moderately overweight women?",
      "Were IGF1 concentrations associated with age at first pregnancy?",
      "Was the Endogenous Hormones and Breast Cancer Collaborative Group established for this analysis?",
      "Did the study find IGF1 concentrations positively associated with height?",
      "Was IGF1 inversely associated with age at menarche?"
    ]
  },
  "ground_truths_2605_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "No",
    "No.",
    "No.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes",
    "Yes",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "No",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes"
  ],
  "materials_v1.1_fewshot_1604_gen50_sel30_ceTrue": {
    "summary": "The document discusses the therapeutic potential of turmeric, specifically its curcuminoid mixture, in treating Alzheimer's disease (AD). It highlights the importance of all components of the curcuminoid mixturecurcumin, demethoxycurcumin, and bisdemethoxycurcuminin providing a more effective treatment for AD compared to curcumin alone. The review emphasizes the need for multi-targeted therapy in addressing the complex etiology of AD.",
    "questions": [
      "Is the curcuminoid mixture said to represent turmeric's medicinal value better than curcumin alone?",
      "Is the curcuminoid mixture considered more promising than curcumin alone for AD treatment?",
      "Is turmeric identified as having multiple medicinal uses, including treatment for AD?",
      "Is the curcuminoid mixture said to represent turmeric better than curcumin alone?",
      "Does the document suggest that other constituents of the curcuminoid mixture also contribute significantly to its effectiveness in AD?",
      "Is the curcuminoid mixture described as having distinct roles in AD treatment?",
      "Does the document emphasize the distinct roles of each component of the curcuminoid mixture in treating AD?",
      "Is the curcuminoid mixture said to combat the challenging disease of AD?",
      "Is the curcuminoid mixture described as having different merits for each component?",
      "Is the curcuminoid mixture considered vital for turmeric's medicinal uses?",
      "Is the curcuminoid mixture described as vital for turmeric's medicinal uses?",
      "Is curcumin considered the most important constituent of the curcuminoid mixture in the document?",
      "Are demethoxycurcumin and bisdemethoxycurcumin identified as constituents of turmeric?",
      "Does the document describe the curcuminoid mixture as promising in combating AD?",
      "Is the effectiveness of curcuminoids in AD supported by a literature study according to the document?",
      "Is the curcuminoid mixture considered more effective than curcumin alone in the document?",
      "Is turmeric's medicinal value linked to its curcuminoid mixture in the document?",
      "Is the curcuminoid mixture linked to turmeric's medicinal value in the document?",
      "Does the document specify curcuminoids as a mixture of curcumin, demethoxycurcumin, and bisdemethoxycurcumin?",
      "Is the curcuminoid mixture emphasized over curcumin alone in the document?",
      "Does the document mention the therapeutic potential of turmeric in AD?",
      "Is the therapeutic potential of turmeric in AD the main focus of the document?",
      "Is multi-site-targeted therapy mentioned as necessary for addressing AD's etiology?",
      "Does the document suggest that curcuminoids offer a multi-targeted therapy for AD?",
      "Does the document suggest exploring newer and alternate treatment options for AD?",
      "Does the document mention the importance of each curcuminoid component in AD treatment?",
      "Does the document discuss the therapeutic potential of curcuminoids in AD?",
      "Does the document imply that curcumin alone is less effective than the curcuminoid mixture?",
      "Is the curcuminoid mixture emphasized in the document?",
      "Does the document discuss the progress in understanding AD's disease etiology?"
    ]
  },
  "ground_truths_1604_30": [
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_3118_gen50_sel30_ceTrue": {
    "summary": "A study tested the effects of an uncooked vegan diet rich in lactobacilli on rheumatoid arthritis patients, showing subjective symptom relief but no significant statistical difference in objective disease activity indicators between diet and control groups. Despite some adverse effects leading to premature cessation for half of the participants, a composite index suggested improved disease activity measures in the intervention group, with regression analysis linking decreased disease activity to dietary factors.",
    "questions": [
      "Did the study conclude that an uncooked vegan diet decreased subjective symptoms of rheumatoid arthritis?",
      "Did half of the patients experience adverse effects such as nausea and diarrhea?",
      "Did a composite index show a higher number of patients with improved disease activity measures in the intervention group?",
      "Were large amounts of living lactobacilli consumed daily suggested to have positive effects on objective measures?",
      "Did the regression analysis associate decreased disease activity with lactobacilli-rich drinks?",
      "Did a return to an omnivorous diet aggravate symptoms for the patients?",
      "Did the study involve testing the effects of a vegan diet on rheumatoid arthritis?",
      "Did some patients stop the experiment prematurely due to adverse effects?",
      "Did the intervention group report subjective relief of rheumatic symptoms?",
      "Was the subjective relief experienced by patients not reflected in objective measures of disease activity?",
      "Was the intervention group on a diet rich in lactobacilli?",
      "Was chlorophyll-rich drink consumption linked to decreased disease activity?",
      "Was subjective symptom relief reported by patients in the intervention group?",
      "Did the Health Assessment Questionnaire show no discernible difference in disease activity between groups?",
      "Did the composite index indicate improvements in 3-5 disease activity measures?",
      "Did the study report adverse effects such as nausea and diarrhea?",
      "Were adverse effects a reason for some patients to stop the experiment?",
      "Was there no need for gold medication associated with decreased disease activity?",
      "Did the study find no statistical difference in disease activity indicators between the intervention and control groups?",
      "Were there statistically significant differences in rheumatic disease activity indicators between the groups?",
      "Was the duration of morning stiffness used as a measure of disease activity?",
      "Was the p-value of the regression analysis 0.02?",
      "Did an increase in fiber intake correlate with decreased disease activity?",
      "Was the diet tested in the study uncooked and vegan?",
      "Did the study find subjective symptom relief in the intervention group?",
      "Was pain on movement included in the objective measures of disease activity?",
      "Was pain at rest considered an objective measure of disease activity?",
      "Were lactobacilli-rich drinks part of the dietary intervention?",
      "Did the regression analysis suggest no need for steroid medication?",
      "Was the study focused on the effects of diet on rheumatoid arthritis?"
    ]
  },
  "ground_truths_3118_30": [
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "No.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_1330_gen50_sel30_ceTrue": {
    "summary": "A randomized controlled crossover trial investigated the impact of egg consumption on endothelial function, a marker of cardiovascular risk, in 49 healthy adults. The study found no significant differences in flow-mediated vasodilation between egg and oat consumption, and while oats reduced cholesterol levels, eggs did not adversely affect endothelial function or cholesterol levels. This supports the notion that dietary cholesterol may be less harmful to cardiovascular health than previously believed.",
    "questions": [
      "Did the study conclude that short-term egg consumption does not adversely affect endothelial function?",
      "Does the study support the view that dietary cholesterol may be less detrimental to cardiovascular health than previously thought?",
      "Was the study conducted to determine the effects of egg ingestion on endothelial function?",
      "Did the post-treatment total cholesterol level after egg consumption measure 205.3 mg/dl?",
      "Did the post-treatment LDL level after egg consumption measure 129.1 mg/dl?",
      "Did the study find no adverse effects of egg consumption on endothelial function?",
      "Did the study find no significant differences in FMD between egg and oat consumption?",
      "Did the study find stable FMD in both egg and oat groups?",
      "Were there no differences in body mass index (BMI) between egg and oat treatments?",
      "Did oats lower total cholesterol to 194 mg/dl?",
      "Was flow-mediated vasodilation (FMD) measured using high-frequency ultrasound?",
      "Did egg consumption have no effect on total cholesterol levels?",
      "Was dietary saturated fat suggested to be more relevant to cardiovascular risk than dietary cholesterol?",
      "Was the p-value for the reduction in LDL due to oats 0.012?",
      "Was the p-value for the reduction in total cholesterol due to oats 0.0017?",
      "Did oats lower LDL to 116.6 mg/dl?",
      "Were the between-treatment differences in FMD not significant?",
      "Were participants assigned to consume two eggs daily for 6 weeks?",
      "Did the trial focus on egg consumption and endothelial function?",
      "Did the study find dietary cholesterol to be less harmful than previously thought?",
      "Did the study involve measuring flow-mediated vasodilation in the brachial artery?",
      "Was the study's focus on the effects of egg ingestion on cardiovascular risk?",
      "Was the baseline LDL level 124.8 mg/dl?",
      "Was the baseline brachial artery reactivity study (BARS) conducted?",
      "Were the effects of egg consumption compared to oats in the study?",
      "Did participants consume oats daily for 6 weeks as part of the study?",
      "Was the baseline total cholesterol level 203.8 mg/dl?",
      "Did the study find no differences in SBP levels between treatments?",
      "Were triglyceride levels unaffected by egg and oat treatments?",
      "Was the study's conclusion based on short-term egg consumption?"
    ]
  },
  "ground_truths_1330_30": [
    "Yes",
    "Yes.",
    "Yes",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes",
    "Yes",
    "Yes",
    "Yes.",
    "Yes."
  ],
  "materials_v1.1_fewshot_2623_gen50_sel30_ceTrue": {
    "summary": "The Lifestyle Heart Trial investigated whether comprehensive lifestyle changes could reverse coronary heart disease. In this study, 28 patients followed a low-fat vegetarian diet, stopped smoking, managed stress, and engaged in moderate exercise, resulting in regression of coronary artery lesions after one year. The trial demonstrated that lifestyle modifications might lead to regression of coronary atherosclerosis without lipid-lowering drugs.",
    "questions": [
      "Did 82% of experimental-group patients have an average change towards regression?",
      "Were comprehensive lifestyle changes suggested to bring about regression of coronary atherosclerosis?",
      "Was the Lifestyle Heart Trial a prospective, randomised, controlled trial?",
      "Did the average percentage diameter stenosis of lesions greater than 50% regress in the experimental group?",
      "Was the trial conducted to determine the effects of lifestyle changes on coronary atherosclerosis?",
      "Did the average percentage diameter stenosis of lesions greater than 50% progress in the control group?",
      "Did the study conclude that lifestyle changes might reverse severe coronary atherosclerosis?",
      "Did the study analyze 195 coronary artery lesions?",
      "Did the average percentage diameter stenosis of lesions greater than 50% in the experimental group change to 55.8%?",
      "Did the study suggest lifestyle changes could reverse coronary atherosclerosis?",
      "Was the average percentage diameter stenosis in the experimental group lower after one year?",
      "Did the study conclude that lifestyle changes could lead to regression of coronary heart disease?",
      "Did the average percentage diameter stenosis regress in the experimental group?",
      "Was a low-fat vegetarian diet part of the lifestyle changes in the experimental group?",
      "Did the average percentage diameter stenosis of lesions greater than 50% in the control group change to 64.4%?",
      "Were 20 patients assigned to the usual-care control group?",
      "Was the study conducted to assess the impact of lifestyle changes on heart disease?",
      "Were the lifestyle changes aimed at reversing coronary heart disease?",
      "Did the average percentage diameter stenosis progress in the control group?",
      "Was the regression of coronary artery lesions observed in the experimental group?",
      "Was stress management training included in the lifestyle changes for the experimental group?",
      "Did the average percentage diameter stenosis in the control group change to 46.1%?",
      "Did the study find that lifestyle changes could lead to regression without medication?",
      "Was the initial average percentage diameter stenosis of lesions greater than 50% in the experimental group 61.1%?",
      "Did the experimental group experience regression of coronary artery lesions?",
      "Did the study measure changes in coronary artery lesions over a period of one year?",
      "Was quantitative coronary angiography used to analyze the lesions?",
      "Was the study conducted without the use of lipid-lowering drugs?",
      "Was the initial average percentage diameter stenosis in the experimental group 40.0%?",
      "Did the average percentage diameter stenosis in the experimental group change to 37.8%?"
    ]
  },
  "ground_truths_2623_30": [
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes.",
    "Yes"
  ],
  "ia_rag_1822_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_2801_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_3590_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_1982_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_2051_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_2212_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1309_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1375_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1112_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_960_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1604_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "no",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_1060_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_3118_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_2623_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_53_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_3246_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_3569_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_570_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_1330_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_2605_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 1,
      "recall@2": 1,
      "recall@3": 1
    }
  },
  "ia_rag_3208_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_2992_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_2853_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1732_nq30_no_def_v2": {
    "parsed_responses": [
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1168_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1863_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_3215_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_3211_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1086_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes",
      "yes",
      "yes",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "yes"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  },
  "ia_rag_1599_nq30_no_def_v2": {
    "parsed_responses": [
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown",
      "unknown"
    ],
    "recall": {
      "recall@1": 0,
      "recall@2": 0,
      "recall@3": 0
    }
  }
}