{"960|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Early life stress and telomere length: Investigating the connection and possible mechanisms How can adverse experiences in early life, such as maltreatment, exert such powerful negative effects on health decades later? The answer may lie in changes to DNA. New research suggests that exposure to stress in early life can lead to telomere shortening, which is a marker of biological aging.", "bleu": 0.0008861133752302346, "ppl": 21.923334980551104, "bertscore": 0.8428304195404053, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1801|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "were found using RIA, EMIT-ST and GC methodologies. Positive immunoassay results were seen up to 60 h post-ingestion. Several different lots of seeds from various sources were assayed for morphine and found to range from 4-200 mg/kg. Differentiation of poppy seed eaters from opiate users was not possible via the identification of minor alkaloid constituents of poppy seeds. It is, however, possible to analyse opiate urines", "bleu": 0.4299201246592396, "ppl": 55.05642005085987, "bertscore": 0.9369066953659058, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1309|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Background: The National Electronic Injury Surveillance System (NEISS) captures a nationally representative probability sample from hospital emergency departments (EDs) in the United States.", "bleu": 0.0002545884930721317, "ppl": 15.766247003936208, "bertscore": 0.8635417222976685, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1112|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "show the power of dietary approaches to managing disease. The current approach to evidence-based medicine encourages physicians to ignore any information that does not come from a double-blind, randomized controlled trial. Yet human beings cannot be blinded to a dietary intervention. As a result, physicians are biased toward drug treatments and against dietary interventions for the management of chronic disease.", "bleu": 0.5212553972349517, "ppl": 24.04370529200248, "bertscore": 0.9401836395263672, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3003|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Dietary protein and bone health: harmonizing conflicting theories. A precise understanding of the role of dietary protein in bone health has been evasive despite decades of research. It is known that a dietary acid load is harmful to bone, and sulfur-containing amino acids are metabolized to provide", "bleu": 0.0015343682275492235, "ppl": 30.589291763366674, "bertscore": 0.8369600772857666, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3590|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Ten men with conservatively treated prostate cancer were randomised to a daily supplement of 295 g of rye bran bread and eight men to 275 g of wheat bread (control) with similar fibre content for three weeks.", "bleu": 0.015764416484854493, "ppl": 75.74352791254648, "bertscore": 0.8845497369766235, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1508|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "identify potential risk factors in the environment. No major risk factors have been identified, however. Over the past 10 years, focus has, therefore, more been directed towards protective factors that could enhance the development of tolerance to allergens which were previously encountered early in life, but are now lost in modern affluent societies. In particular, the role of childhood infections has been discussed, but so far these studies have not been conclusive. Recent epidemiological studies and experimental research suggest that the microbial", "bleu": 0.10798030262291458, "ppl": 28.360529146277216, "bertscore": 0.9119778871536255, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2801|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "The objective of this study is to investigate the risk of esophageal carcinoma in a cohort with long-term occupational exposure to sodium nitrite. The method used was a retrospective cohort study. A small wood screw manufacturer was founded in 1977 and closed down in 2000. In their production process, the sodium nitrite solution was used to serve as anticorrosive and coolant fluid. One hundred sixty workers in turning and milling shops had direct exposure to sodium nitrite through", "bleu": 0.0582288994143251, "ppl": 27.07881242159334, "bertscore": 0.9052162766456604, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1822|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "(b) transfer of genetic material from the parasite to the host, causing DNA damage and malignant transformation of host cells, and (c) chronic inflammation with liberation of nitric oxide and inhibition of tumor suppressor genes. Further research is needed to confirm the potential role of cysticercosis in the development of cancer. These studies should determine the presence of cysticercotic factors responsible for the transfer of genetic material and potential mutations in the tumor suppressor genes in proliferating astrocy", "bleu": 0.308912346712812, "ppl": 20.94356113965648, "bertscore": 0.9243246912956238, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3296|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "The Kuna Indians who reside in an archipelago on the Caribbean Coast of Panama have very low blood pressure levels, live longer than other Panamanians, and have a reduced frequency of myocardial infarction, stroke, diabetes mellitus, and cancer -- at least on their death certificates.", "bleu": 0.20833093062499142, "ppl": 23.423821539766767, "bertscore": 0.9188799858093262, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "979|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "The U.S. Food and Drug Administration (FDA) terminated the use of ball clay from a mine in Mississippi as an additive in animal feed after discovering nanogram per gram concentrations of 2,3,7,8-tetrachlorodibenzo-p-dioxin (2,3,7,8-TCDD). The FDA collected chicken eggs and farm-raised catfish in affected areas and throughout the remaining continental United States to assess levels of 2,3", "bleu": 0.09933336101077359, "ppl": 21.028790543138708, "bertscore": 0.9039973616600037, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2212|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Further investigations are warranted to better understand mechanisms underlying asthma increase or stagnation.", "bleu": 0.0002520925475441014, "ppl": 291.7349320412671, "bertscore": 0.8789191842079163, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1124|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Sirolimus (rapamycin), an immunosuppressive drug, may also have antitumor effects.", "bleu": 1.0527744201162048e-07, "ppl": 31.627369981582262, "bertscore": 0.836486279964447, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1982|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Watercress (Cruciferae), an integral part of Mediterranean diets, is a nutritive food which is used in the treatment of several diseases.", "bleu": 0.00022835356998738426, "ppl": 31.800081146281517, "bertscore": 0.8508397936820984, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2051|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "consumption of vegetables on 6-sulfatoxymelatonin concentrations in morning urine. Ninety-four healthy women aged 24-55 were recruited through a city public health center in Japan.", "bleu": 7.239789501792427e-05, "ppl": 49.280238787995394, "bertscore": 0.8447436094284058, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "317|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "- Organophosphorus pesticide exposure of urban and suburban preschool children with organic and conventional diets. We assessed organophosphorus (OP) pesticide exposure from diet by biological monitoring among Seattle, Washington, preschool children. Parents kept food diaries for 3 days before urine c\n- Organic Diets Significantly Lower Children’s Dietary Exposure to Organophosphorus Pesticides We used a novel study design to measure dietary organophosphorus pesticide exposure in a group of 23", "bleu": 0.004694187010161105, "ppl": 50.05350900132436, "bertscore": 0.8055621385574341, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1375|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Statin use and risk of breast cancer: a meta-analysis of observational studies. Emerging evidence suggests that statins' may decrease the risk of cancers. However, available evidence on breast cancer is conflicting. We, therefore, examined the association between statin use and risk of breast cancer", "bleu": 0.0010180567848177375, "ppl": 17.560960947901624, "bertscore": 0.8400997519493103, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1170|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Blood concentrations of harmane and lead were each quantified in 257 individuals (106 essential tremor cases and 151 controls) enrolled in an environmental epidemiological study.", "bleu": 3.664308902409973e-05, "ppl": 147.35808284884598, "bertscore": 0.8507747650146484, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1120|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "neonatal growth of mammals. Cell growth is regulated by the nutrient-sensitive kinase mechanistic target of rapamycin complex 1 (mTORC1).", "bleu": 0.000766318220155953, "ppl": 51.99248335842186, "bertscore": 0.8720794320106506, "recall": {"recall@1": 0, "recall@2": 1, "recall@3": 1}}, "316|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "In 1997 this laboratory initiated a research program with the objective of examining the effect that rinsing of produce with tap water would have on pesticide residues. Samples were obtained from local markets and/or grown at our experimental farm.", "bleu": 0.0048655214002355, "ppl": 53.17150662520852, "bertscore": 0.8767232894897461, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1330|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Egg consumption and endothelial function: a randomized controlled crossover trial. BACKGROUND: Because of egg cholesterol content, reduction in egg consumption is generally recommended to reduce risk of cardiovascular disease. Recently, however, evidence has been accumulating to suggest that dietary cholesterol is less relevant to cardiovascular risk than dietary saturated fat. This randomized controlled crossover trial was conducted to determine the effects of egg ingestion on endothelial function, a reliable index of cardiovascular risk. METHODS: Forty-nine healthy adults (mean age", "bleu": 0.07986061092131708, "ppl": 12.162619947874191, "bertscore": 0.9003359079360962, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3569|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Participants were 15,200 men and 26,187 women (17.3% Blacks) across the U.S. and Canada who were free of diabetes and who provided demographic, anthropometric, lifestyle and dietary data.", "bleu": 0.0001412661490571287, "ppl": 21.739961423397876, "bertscore": 0.0, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1863|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "metabolic acidosis, whose magnitude increases progressively with aging due to the physiological decline in kidney function. In response to this state of diet-derived metabolic acidosis, the kidney implements compensating mechanisms aimed to restore the acid-base balance, such as the removal of the non-metabolizable anions, the conservation of citrate, and the enhancement of kidney ammoniagenesis and urinary excretion of ammonium ions. These adaptive processes lower the urine pH and induce an extensive change", "bleu": 0.08365846524964597, "ppl": 34.05254418577853, "bertscore": 0.9017095565795898, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "570|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Mechanisms underlying skeletal muscle insulin resistance induced by fatty acids: importance of the mitochondrial function Insulin resistance condition is associated to the development of several syndromes, such as obesity, type 2 diabetes mellitus and metabolic syndrome. Although the factors linking insulin resistance to these syndromes are not precisely defined yet, evidence suggests that the elevated plasma free fatty acid (FFA) level plays an important role in the development of skeletal muscle insulin resistance. Accordantly, in vivo", "bleu": 0.3309187662395444, "ppl": 14.838849344209843, "bertscore": 0.9462226629257202, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2623|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "In a prospective, randomised, controlled trial to determine whether comprehensive lifestyle changes affect coronary atherosclerosis after 1 year, 28 patients were assigned to an experimental group (low-fat vegetarian diet, stopping smoking, stress management training, and moderate exercise) and 20 to a usual-care control group.", "bleu": 0.05073536507918104, "ppl": 31.385523758086567, "bertscore": 0.8968284726142883, "recall": {"recall@1": 0, "recall@2": 1, "recall@3": 1}}, "2605|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "mitosis and inhibits apoptosis. Some published results have shown an association between circulating IGF1 and breast-cancer risk, but it has been unclear whether this relationship is consistent or whether it is modified by IGF binding protein 3 (IGFBP3), menopausal status, oestrogen receptor status or other factors. The relationship of IGF1 (and IGFBP3) with breast-cancer risk factors is also unclear. The Endogenous Hormones and", "bleu": 0.007518332114504679, "ppl": 14.985545246705412, "bertscore": 0.0, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1732|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Evidence on the Human Health Effects of Low-Level Methylmercury Exposure Background: Methylmercury (MeHg) is a known neuro-toxicant. Emerging evidence indicates it may have adverse effects on the neuro-logic and other body systems at common low levels of exposure. Impacts of MeHg exposure could vary", "bleu": 0.008737920503618065, "ppl": 19.10779047893599, "bertscore": 0.8536317944526672, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2992|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Olive oil and walnut breakfasts reduce the postprandial inflammatory response in mononuclear cells compared with a butter breakfast in healthy men. BACKGROUND: Inflammation is crucial in all stages of atherosclerosis, and few studies have investigated the effect of dietary fat on markers of inflammation related to this disease during the postprandial period. OBJECTIVE: To evaluate the chronic effects of dietary fat on the postprandial expression of proinflammatory genes in peripheral blood", "bleu": 0.019561136235447817, "ppl": 14.499141369297718, "bertscore": 0.8874273300170898, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "53|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Combining foods with recognized cholesterol-lowering properties (dietary portfolio) has proven highly effective in lowering serum cholesterol under metabolically controlled conditions.", "bleu": 9.407239018026195e-11, "ppl": 47.6445884258143, "bertscore": 0.0, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3211|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Earlier age at menarche is associated with rapid infancy weight gain and childhood obesity. The role of hormone levels in mediating these associations is unclear. Objective: The \n\nHigher Levels of IGF-I and Adrenal Androgens at Age 8 Years Are Associated with Earlier Age at Menarche in Girls", "bleu": 0.0007655428772371551, "ppl": 32.5022841233386, "bertscore": 0.829759955406189, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3215|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Meat intake and reproductive parameters among young men Background In the United States, anabolic sex steroids are administered to cattle for growth promotion. There is concern regarding the reproductive consequences of this practice for men who eat beef. We investigated whether meat consumption was", "bleu": 0.00034194122263336624, "ppl": 45.60327021750096, "bertscore": 0.8322750926017761, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3208|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Mercury in human hair as an indicator of the fish consumption. OBJECTIVES: Mercury and most of its compounds are extremely toxic and should be handled with care. It can be inhaled and absorbed through the skin and mucous membranes. The most toxic forms of mercury are its organic compounds such as di", "bleu": 0.0044588740711439204, "ppl": 26.16236176489714, "bertscore": 0.8154696226119995, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1168|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Relative exposure to beta-carbolines norharman and harman from foods and tobacco smoke. Norharman and harman are two heterocyclic beta-carboline (9H-pyrido[3,4-b]indole) alkaloids with biological and potential toxicological activity that appear in foodstuffs and environmental sources. To assess the", "bleu": 0.0007620054487751819, "ppl": 45.32491313439224, "bertscore": 0.8197548389434814, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1086|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Effects of tomato extract on human platelet aggregation in vitro. Among all fruits tested in vitro for their anti-platelet property, tomato had the highest activity followed by grapefruit, melon, and strawberry, whereas pear and apple had little or no activity. Tomato extract (20-50 microl of 100% juice) inhibited platelet aggregation induced by ADP and arachidonic acid in a concentration-dependent manner.", "bleu": 0.007507454476574353, "ppl": 16.974091729733, "bertscore": 0.831648051738739, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3246|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "legume consumption and measures of cardiovascular disease and obesity. However, few observational trials have examined beans as a separate food variable when determining associations with health parameters. OBJECTIVE: To determine the association of consuming beans on nutrient intakes and physiological parameters using the National Health and Examination Survey (NHANES) 1999-2002.", "bleu": 0.011989442434601382, "ppl": 31.434095340914364, "bertscore": 0.8842264413833618, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2853|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Combinatorial strategies employing nutraceuticals for cancer development. Cancer is the second leading cause of death worldwide. Therefore, the fight against cancer is one of the most important areas of research in medicine, and one that possibly contributes to the increased interest in chemoprevent", "bleu": 8.84429354828857e-05, "ppl": 18.78450847133682, "bertscore": 0.8091753125190735, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1604|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Hence, newer and alternate treatment options are being explored for effective and safer therapeutic targets to address AD.", "bleu": 1.6701700790245666e-05, "ppl": 140.790405791968, "bertscore": 0.8524864315986633, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1060|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Subjects and Methods. This follow up clinical study was carried out on 63 infants with perianal dermatitis of more than 3 weeks with history of recurrence. Definitive diagnosis was made for each infant through medical history taking, clinical examination and investigations including stool analysis and culture, stool pH and reducing substances, perianal swab for different cultures and staining for Candida albicans. Complete blood count and quantitative determination of cow's milk-specific serum IgE concentration were done", "bleu": 0.116700069032911, "ppl": 45.18816078811249, "bertscore": 0.9017241597175598, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1599|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Total oxalate content ranged from 194 (nutmeg) to 4,014 (green cardamom) mg/100 g DM, while the soluble oxalate contents ranged from 41 (nutmeg) to 3,977 (green cardamom) mg/100 g DM. Overall, the percentage of soluble oxalate content of the spices ranged from 4.7 to 99.1% of the total oxalate content", "bleu": 0.1527751756017147, "ppl": 13.532035335053235, "bertscore": 0.9165852069854736, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3118|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "We tested the effects of an uncooked vegan diet, rich in lactobacilli, in rheumatoid patients randomized into diet and control groups. The intervention group experienced subjective relief of rheumatic symptoms during intervention. A return to an omnivorous diet aggravated symptoms. Half of the patients experienced adverse effects (nausea, diarrhoea) during the diet and stopped the experiment prematurely. Indicators of rheumatic disease activity did not differ statistically between groups. The positive subjective", "bleu": 0.13701644539375946, "ppl": 25.71246512779522, "bertscore": 0.9176581501960754, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2567|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "PCBs) on children versus the benefits of breastfeeding. In this article, the", "bleu": 1.1643874746070028e-06, "ppl": 94.93478966489226, "bertscore": 0.8180831670761108, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1061|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Cow's milk protein intolerance and chronic constipation in children. Cow's milk protein (CMP) allergy was investigated in 25 children (age-range 3 months to 11 years) with chronic constipation. A diagnosis of constipation was made on the basis of a history of painful elimination of hard stools for a", "bleu": 0.000586735414317175, "ppl": 24.572430638324768, "bertscore": 0.8458344340324402, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1944|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Oral sildenafil citrate (viagra) for erectile dysfunction: a systematic review and meta-analysis of harms. OBJECTIVES: To summarize and compare evidence on harms in sildenafil- and placebo-treated men with erectile dysfunction (ED) in a systematic review and meta-analysis. METHODS: Randomized placeb", "bleu": 0.0005678982747471375, "ppl": 9.814895832693452, "bertscore": 0.8376339673995972, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2611|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "genetics, and sex steroid hormones play prominent roles in the cause of benign prostatic hyperplasia", "bleu": 2.1233829711794406e-06, "ppl": 26.975936827712424, "bertscore": 0.8516837358474731, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "651|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Systematic review and meta-analysis of clinical trials of the effects of low carbohydrate diets on cardiovascular risk factors. A systematic review and meta-analysis were carried out to study the effects of low-carbohydrate diet (LCD) on weight loss and cardiovascular risk factors (search performed", "bleu": 0.00021342506918821033, "ppl": 10.501996280268731, "bertscore": 0.8055709600448608, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2135|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Increase of 210Po levels in human semen fluid after mussel ingestion. Polonium-210 ((210)Po) radioactive concentrations were determined in human semen fluid of vasectomized non-smoker volunteers. The (210)Po levels ranged from 0.10 to 0.39 mBq g(-1) (mean: 0.23 ± 0.08 mBq g(-1)). This value decrease", "bleu": 0.0005953138628336936, "ppl": 36.351951556401964, "bertscore": 0.8065218925476074, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1135|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Whole grain intake in relation to body weight: from epidemiological evidence to clinical trials. This viewpoint aims to 1) review the available scientific literature on the relationship between whole grain consumption and body weight regulation; 2) evaluate the potential mechanisms whereby whole grain consumption may influence body weight.", "bleu": 0.005876234798384192, "ppl": 17.9020222788537, "bertscore": 0.8277745842933655, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1012|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "The lifestyle intervention reduced the incidence by 58 percent (95 percent confidence interval, 48 to 66 percent) and metformin by 31 percent (95 percent confidence interval, 17 to 43 percent), as compared with placebo; the lifestyle intervention was significantly more effective than metformin. To prevent one case of diabetes during a period of three years, 6.9 persons would have to participate in the lifestyle-intervention program, and 13.9 would", "bleu": 0.04277083926538656, "ppl": 15.455753354460459, "bertscore": 0.8847751617431641, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2675|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Egg yolk consumption and carotid plaque. BACKGROUND: Increasingly the potential harm from high cholesterol intake, and specifically from egg yolks, is considered insignificant. We therefore assessed total plaque area (TPA) in patients attending Canadian vascular prevention clinics to determine if the atherosclerosis burden, as a marker of arterial damage, was related to egg intake. To provide perspective on the magnitude of the effect, we also analysed the effect of smoking (pack-years). METHODS:", "bleu": 0.06790435062842606, "ppl": 33.41928406245154, "bertscore": 0.905892550945282, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1895|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "whereas others such as porcine torque teno virus (TTV), now known as Torque teno sus virus (TTSuV), porcine bocavirus (PBoV) and related novel parvoviruses, porcine kobuvirus, porcine toroviruses (PToV) and porcine lymphotropic herpesviruses (PLHV), are mostly subclinical in swine herds.", "bleu": 0.018981590049947407, "ppl": 40.938773350029095, "bertscore": 0.893997073173523, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1709|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Inositol hexaphosphate (IP6) inhibits key events of cancer metastasis: II. Effects on integrins and focal adhesions. BACKGROUND: We have shown that inositol hexaphosphate (IP6), a natural compound and a potent anti-cancer agent, inhibited cancer cell adhesion to the extracellular matrix (ECM) proteins.", "bleu": 0.0009620547594261326, "ppl": 17.040254242423376, "bertscore": 0.8344303369522095, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2227|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Dietary patterns and the risk of esophageal cancer. BACKGROUND: The role of dietary habits on esophageal cancer risk has been rarely considered in terms of dietary patterns. PATIENTS AND METHODS: We analyzed data from an Italian case-control study, including 304 cases with squamous cell carcinoma of", "bleu": 0.00046530561874837036, "ppl": 13.429142108396517, "bertscore": 0.8231732845306396, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3487|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Epidemiological studies in women have revealed an association between caffeine intake and urinary incontinence, although evidence among men is limited. Therefore, we evaluated the association between caffeine intake and urinary incontinence in United States men. MATERIALS AND METHODS: Data were used from male NHANES (National Health and Nutrition Examination Surveys) 2005-2006 and 2007-2008 participants.", "bleu": 0.006945252337816764, "ppl": 10.094127135913737, "bertscore": 0.8845827579498291, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2068|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "the major food categories and the risk of new depression four years later in older Taiwanese. DESIGN: A prospective cohort study with multistage random sampling.", "bleu": 2.7536449349747168e-05, "ppl": 88.48460809839598, "bertscore": 0.8500912189483643, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2563|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "ergothioneine have been implicated in the etiopathogenesis of autoimmune disorders. However, available evidence about dietary sources and the functional role of ergothioneine in human physiology is scarce. Here, we analyzed the ergothioneine content in common foods using liquid chromatography tandem-mass spectrometry. Additionally, we assessed the protective potency of ergothioneine against various oxidative stressors in OCTN1-expressing cells in comparison with the main intracellular th", "bleu": 0.22461441592592313, "ppl": 17.633740796584792, "bertscore": 0.909888505935669, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2970|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "There is ample reason to believe that diets rich in phytochemicals provide protection from vascular diseases and many cancers; direct antioxidant activity as well as modulation of enzyme expression or hormone activity contribute to this effect. Phytochem", "bleu": 0.0031987277891774315, "ppl": 29.678958248899292, "bertscore": 0.8845524191856384, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1843|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "The effects of daily consumption of grapefruit on body weight, lipids, and blood pressure in healthy, overweight adults. Folklore has suggested that consuming grapefruit may promote weight control. Sparse data exist to support this hypothesis, although there is some evidence of health promotion effects of grapefruit consumption.", "bleu": 0.0011629514954868024, "ppl": 19.35287590349141, "bertscore": 0.8337050080299377, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "377|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "human nutrition research linking food intake to obesity in 2001-2005 was drawn from two distinct sources: (a) the federal government's semi-public generic commodity promotion or \"checkoff\" programs for Fluid Milk and Dairy and (b) the National Institutes of Health (NIH).", "bleu": 0.045222802188365586, "ppl": 57.77384690927982, "bertscore": 0.8950410485267639, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1984|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Vegetarian diet affects genes of oxidative metabolism and collagen synthesis. BACKGROUND/AIM: A vegetarian diet is known to prevent a series of diseases but may influence the balance of carbohydrate and fat metabolism as well as collagen synthesis. This study compares expression patterns of relevant genes in individuals following a vegetarian diet with those of individuals consuming a mixed diet.", "bleu": 0.006198704972079484, "ppl": 27.331135646869296, "bertscore": 0.8427563905715942, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2053|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Although the hormone melatonin is a key factor for the proper functioning of the circadian timing system (CTS) and exogenous melatonin has been shown to be beneficial in cases of CTS disturbances, a deficit of melatonin has yet to be defined as a disorder. The aim of our study was to collect a normative data set on 24-h melatonin excretion in healthy human adults living in a natural environment.", "bleu": 0.020891329707155744, "ppl": 18.519728950854766, "bertscore": 0.8750903606414795, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2303|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Cinnamon, the dry bark and twig of Cinnamomum spp., is a rich botanical source of polyphenolics that has been used for centuries in Chinese medicine and has been shown to affect blood glucose and insulin signaling.", "bleu": 0.0009349663674165826, "ppl": 21.374316887811194, "bertscore": 0.8642575740814209, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "759|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "the glucose response is similar, whereas the insulin response is lower.", "bleu": 1.6280604388287254e-10, "ppl": 27.485477124707725, "bertscore": 0.8278262615203857, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "314|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "few studies examined risks for children in the general population. Objective To examine the association between the concentrations of urinary dialkyl phosphate (DAP) metabolites of OPs and attention deficit/hyperactivity disorder (ADHD) in children age 8 to 15 years. Participants and Methods Cross-sectional data from the National Health and Nutrition Examination Survey (2000–2004) were available for 1,139 children representative of the general U.S. population. A structured interview", "bleu": 0.051047434004154416, "ppl": 17.25180613555818, "bertscore": 0.8786560297012329, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3086|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "between 45 degrees C and 70 degrees C, and residual infectivity was determined in a cell culture system that was permissive for both viruses. Although HEV was less stable than was HAV, some HEV would most likely survive the internal temperatures of rare-cooked meat.", "bleu": 0.47236655274101486, "ppl": 67.85718793021584, "bertscore": 0.9357888102531433, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1664|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Two-year randomized, placebo-controlled study of black currant anthocyanins on visual field in glaucoma. AIM: To examine the influence of the black currant anthocyanins (BCACs) on the disease progression of open-angle glaucoma (OAG), a randomized, placebo-controlled, double-masked trial was made in 38 patients with OAG treated by antiglaucoma drops. METHODS: BCACs (50 mg/day, n =", "bleu": 0.053473374140990654, "ppl": 16.166024348999958, "bertscore": 0.9076229333877563, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "875|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Higher intake of total protein, and protein from animal sources was associated with subsequent weight gain for both genders, strongest among women, and the association was mainly attributable to protein from red and processed meat and poultry rather than from fish and dairy sources. There was no overall association between intake of plant protein and subsequent changes in weight.", "bleu": 0.01060027854901945, "ppl": 16.50594654526114, "bertscore": 0.8742379546165466, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2589|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "In this review recent publications are cited for a number of antimutagens. The molecules surveyed are potential or proven \"desmutagens\" or \"interceptors.\" These are biologically prevalent or synthetic molecules that are most often small metabolites proficient in binding to, or reacting with, mutagenic chemicals and free radicals. Many of this class of \"blocking agents\" are \"soft\" and \"hard\" nucleophiles with consequently varying abilities to react with particular classes of electroph", "bleu": 0.49937225136299934, "ppl": 72.53689197917069, "bertscore": 0.9427605867385864, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "681|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Reducing the incidence of twins and triplets. Multiple pregnancy rates remain high after assisted conception because of a misconceived assumption that transferring three or more embryos will maximize pregnancy rates. Maternal morbidity is sevenfold greater in multiple pregnancies than in singletons,", "bleu": 0.0012241406226725844, "ppl": 36.59523816128185, "bertscore": 0.8390728235244751, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3243|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "OBJECTIVE We assessed the prevalence of type 2 diabetes in people following different types of vegetarian diets compared with that in nonvegetarians. RESEARCH DESIGN AND METHODS The study population comprised 22,434 men and 38,469 women who participated in the Adventist Health Study-2 conducted in 2002–2006. We collected self-reported demographic, anthropometric, medical history, and lifestyle data from Seventh-Day Adventist church members across North America. The type of vegetarian", "bleu": 0.02762480726805881, "ppl": 13.139062412633821, "bertscore": 0.8887708783149719, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1161|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Norharman and harman are two heterocyclic beta-carboline (9H-pyrido[3,4-b]indole) alkaloids with biological and potential toxicological activity that appear in foodstuffs and environmental sources. To assess the occurrence and distribution of these compounds and to estimate the exposure levels based on the detected amounts, numerous samples of foodstuffs and cigarette smoke were analysed by solid-phase extraction and high-performance liquid chromatography-fluorescence.", "bleu": 0.013509693338951204, "ppl": 33.6852254126646, "bertscore": 0.8900998830795288, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3491|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "The aim of this meta-analysis was to quantitatively summarize the effect of caffeine on IOP in normal individuals and in patients with glaucoma or ocular hypertension (OHT).", "bleu": 1.2792305934136393e-05, "ppl": 19.7830472745018, "bertscore": 0.859081506729126, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1642|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Curcumin (diferuloylmethane), a component of turmeric (Curcuma longa) that is very inexpensive, orally bioavailable and highly safe in humans, yet can block TNF-α action and production in in vitro models, in animal models and in humans.", "bleu": 0.00345937733646476, "ppl": 25.829950749622462, "bertscore": 0.8651402592658997, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1974|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "As a concomitant effect, there is a growing interest in natural, healthy food and an increasing awareness of risk factors and determinants of disease. This chapter describes some nutritional facts about seaweeds, which have been used as food since ancient times in China, Japan, Egypt, and India and comments on the potential utilization of marine algae as functional foods. This concept and the description of metabolic syndrome are used as a basis to comprehension of seaweeds against two dreadful illnesses of", "bleu": 0.5153436350466564, "ppl": 38.90936066163396, "bertscore": 0.9290115833282471, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "3001|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Tritiated naloxone, a powerful opiate antagonist, specifically binds to an opiate receptor of mammalian brain and guinea pig intestine.", "bleu": 0.21321493331446223, "ppl": 49.731729615124195, "bertscore": 0.9295225739479065, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2629|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "This systematic review collated seventy-eight studies exploring waist-to-height ratio (WHtR) and waist circumference (WC) or BMI as predictors of diabetes and CVD, published in English between 1950 and 2008. Twenty-two prospective analyses showed that WHtR and WC were significant predictors of these cardiometabolic outcomes more often than BMI, with similar OR, sometimes being significant predictors after adjustment for BMI. Observations from cross-sectional analyses, forty-four in adults,", "bleu": 0.09655308312681705, "ppl": 24.65187147325658, "bertscore": 0.915580153465271, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2844|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "ulcers, cancer and to promote wound healing. To evaluate the potential role of sangre de grado (SdG) in cancer we examined its effects on human cancer cells, AGS (stomach), HT29 and T84 (colon). Viability of cells treated with SdG (10-200 microg/ml) decreased (P<0.01) in a dose dependent manner measured over a 24-h period. Cell proliferation at 48 h decreased (P", "bleu": 0.11751650694951657, "ppl": 33.73268295068876, "bertscore": 0.9007512331008911, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2650|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "However, nuts are an important source of many vitamins, minerals, monounsaturated and polyunsaturated fatty acids. This paper reviewed all the available evidence from the literature in relation to nut consumption and body weight. The findings show that the role of nut consumption in body weight management is varied. Nuts, when included as part of an energy-controlled diet, were found in some instances to assist with weight loss. However, when nuts were added to an existing diet without controlling for energy", "bleu": 0.19745941247377177, "ppl": 14.438211152717967, "bertscore": 0.9312937259674072, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "750|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "84%, and the prevalence of chronic low back pain is about 23%, with 11-12% of the population being disabled by low back pain.", "bleu": 0.010248282368032005, "ppl": 18.085092088659135, "bertscore": 0.8820461630821228, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2214|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "A facile method was established to measure heterocyclic aromatic amines (HAAs) accumulated in human hair and rodent fur. The samples were digested by base hydrolysis, and the liberated HAAs were isolated by tandem", "bleu": 1.596447764000873e-05, "ppl": 32.550209158785606, "bertscore": 0.78737473487854, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2682|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Four varieties of white tea, which represent the least processed form of tea, were shown to have marked antimutagenic activity in the Salmonella assay, particularly in the presence of S9. The most active of these teas, Exotica China white tea, was significantly more effective than Premium green tea (Dragonwell special grade) against 2-amino-3-methylimidazo[4,5-f]quinoline (IQ) and four other heterocyclic am", "bleu": 0.020780308895073523, "ppl": 33.61738213560786, "bertscore": 0.0, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "401|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "high in viscous fibers, soy proteins, or plant sterols. We have therefore combined all of these interventions in a single diet (portfolio diet) to determine whether cholesterol reductions could be achieved of similar magnitude to those reported in recent statin trials which reduced cardiovascular events. Twenty-five hyperlipidemic subjects consumed either a portfolio diet (n=13), very low in saturated fat and high in plant sterols (1.2 g/1,000 kcal), soy protein (", "bleu": 0.03163508871384698, "ppl": 26.67614835078269, "bertscore": 0.8797052502632141, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "968|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Curcumin, from the curry spice turmeric, has been shown to possess potent antioxidant and antiinflammatory properties and to reduce beta-amyloid and plaque burden in experimental studies, but epidemiologic evidence is lacking.", "bleu": 0.01995479698276844, "ppl": 27.711333422675356, "bertscore": 0.8912604451179504, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1552|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Whether this comprises excessive energy intake, lowered physical activity or both, remains disputed.", "bleu": 2.9989608248573085e-09, "ppl": 140.00245068768965, "bertscore": 0.8564382791519165, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1898|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Non-occupational malignant pleural mesothelioma due to asbestos and non-asbestos fibres. BACKGROUND AND AIM: The occurrence of malignant pleural mesothelioma (MPM) has been reported among population groups with no documented professional exposure to asbestos fibres living in different geographic areas. This paper reviews existing data related to non occupational MPM including its occurrence in the province of Catania (Sicily, Italy). METHODS: An electronic search of literature related to", "bleu": 0.1318653403488648, "ppl": 25.421826114588452, "bertscore": 0.9319064021110535, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "2858|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Açai, a fruit indigenous to the Amazon, is rich in phytochemicals that possesses high anti-oxidant activities, and has anti-inflammatory, anti-cancer and anti-cardiovascular disease properties.", "bleu": 0.0005436301686676231, "ppl": 16.234567311297138, "bertscore": 0.8676685690879822, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "240|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "especially concerning its motor activity. However, in recent years, techniques have been perfected that allow a better understanding of colonic motility, especially through prolonged recording periods. In this way, it has been demonstrated that the viscus contracts according to a circadian trend, is responsive to physiological stimuli (meals, sleep), and features high amplitude, propulsive contractions that are part of the complex dynamic of the defecatory process. These physiological properties and their alterations in patients with", "bleu": 0.6642538428642957, "ppl": 51.596435810629714, "bertscore": 0.9428330063819885, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1970|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "systolic velocity (PSV) measured in the flaccid state during penile color Doppler ultrasound (PCDU) examination has been questioned without substantial evidence.", "bleu": 3.0590232050182594e-07, "ppl": 72.80784257383408, "bertscore": 0.0, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "207|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "may see only a minority of sufferers.", "bleu": 2.97832626862023e-16, "ppl": 66.53135370077743, "bertscore": 0.8416642546653748, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "66|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "women of reproductive age. Insulin resistance and hyperinsulinemia appear to play an important role in its pathogenesis. Here, we will present a characterization of a PCOS cohort from North Rhine-Westphalia in Germany. Clinical features, family history as well as endocrine and metabolic parameters were prospectively recorded from 200 successive patients. All patients were evaluated for insulin resistance and beta-cell-function by oral glucose tolerance test. Patient data were compared with those of 98 age", "bleu": 0.13871645468851576, "ppl": 20.18462544226533, "bertscore": 0.9014585614204407, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "674|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Disease is a complex inherited disorder of unknown pathogenesis with environmental, genetic and microbial factors involved in the development of the disease.", "bleu": 0.00017956020542583305, "ppl": 27.87822868291064, "bertscore": 0.865624725818634, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3458|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "punctal occlusion surgery with a high heat-energy-releasing cautery device in patients with severe dry eye disease and recurrent punctal plug extrusion. DESIGN: Prospective, interventional case series. METHODS: Seventy puncta from 44 eyes of 28 dry eye patients underwent punctal occlusion with thermal cautery. All patients had a history of recurrent punctal plug extrusion. A high heat-energy-releasing thermal cautery device (Optemp II V;", "bleu": 0.04511269667818245, "ppl": 33.12234530700519, "bertscore": 0.8868080973625183, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "1815|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "To maintain immune function, athletes should eat a well-balanced diet sufficient to meet their energy, carbohydrate, protein, and micronutrient requirements. Consuming carbohydrate during prolonged strenuous exercise attenuates rises in stress hormones and appears to limit the degree of exercise-induced immune depression. Recent evidence suggests that antioxidant vitamin supplementation may also reduce exercise stress and impairment of leukocyte functions.", "bleu": 0.5160567899373151, "ppl": 25.71144138316605, "bertscore": 0.9498533010482788, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2254|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "OBJECTIVE: To evaluate the evidence for and against the effectiveness of homeopathy.", "bleu": 1.4521602211810068e-06, "ppl": 16.832030899834642, "bertscore": 0.8449472188949585, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "382|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Pathogenesis of type 2 diabetes: tracing the reverse route from cure to cause. The metabolic abnormalities of type 2 diabetes can be reversed reproducibly by bariatric surgery. By quantifying the major pathophysiological abnormalities in insulin secretion and insulin action after surgery, the sequence of events leading to restoration of normal metabolism can be defined. Liver fat levels fall within days and normal hepatic insulin sensitivity is restored. Simultaneously, plasma glucose levels return towards normal. Ins", "bleu": 0.0656648461877084, "ppl": 30.603509231508347, "bertscore": 0.915065348148346, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "3303|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "green tea alone and/or in association in dyslipidemic subjects. METHODS: One hundred dyslipidemic individuals were allocated into four groups. The soy group ingested 50 g of soy (kinako) daily, and the green tea group ingested 3 g of green tea in 500 mL of water per day. A third group ingested 50 g of soy and 3 g of green tea daily, and the control group had a hypocholester", "bleu": 0.04613049393681578, "ppl": 17.9413582483808, "bertscore": 0.8750595450401306, "recall": {"recall@1": 1, "recall@2": 1, "recall@3": 1}}, "8|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Among plant foods, grain products, legumes, and seeds are important sources of phosphorus (P). Current data on P content and absorbability of P from these foods are lacking. Measurement of in vitro digestible P (DP) content of foods may reflect absorbability of P. The objective of this study was to measure both total phosphorus (TP) and DP contents of selected foods and to compare the amounts of TP and DP and the proportion of DP to TP among different", "bleu": 0.05145575498731651, "ppl": 22.198309050835363, "bertscore": 0.8910528421401978, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "60|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "strengthening public health systems and building human resource capacity. The Ethiopian Field Epidemiology and Laboratory Training Program (EFELTP) is a comprehensive two-year competency-based training and service program designed to build sustainable public health expertise and capacity. Established in 2009, the program is a partnership between the Ethiopian Federal Ministry of Health, the Ethiopian Health and Nutrition Research Institute, Addis Ababa University School of Public Health, the Ethiopian Public Health Association and the US Centers of Disease Control", "bleu": 0.13218809457765002, "ppl": 16.45083010775215, "bertscore": 0.9129735231399536, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "2671|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Hence there is a need to evolve a food-based strategy to improve the same to combat widespread deficiencies of these minerals in a population dependent on plant foods.", "bleu": 9.365787256005543e-05, "ppl": 53.25018800235945, "bertscore": 0.8612089157104492, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1971|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "Subclinical coronary artery atherosclerosis in patients with erectile dysfunction. OBJECTIVES: The purpose of our study was to assess the prevalence and extent of coronary artery atherosclerosis in asymptomatic patients with vascular erectile dysfunction (ED). BACKGROUND: An association between ED and coronary artery disease has been reported, but the prevalence and extent of coronary artery atherosclerosis in asymptomatic patients with ED are unknown.", "bleu": 0.011944169317448197, "ppl": 6.521512546452528, "bertscore": 0.8404149413108826, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}, "1989|no_def|300|96|120|llama-3.1-8b|title_and_snippet|v3": {"answer": "However, I don't see an excerpt provided for me to extract the continuation from. Please provide the excerpt you would like me to find the continuation for.", "bleu": 1.4133889677666715e-06, "ppl": 49.027608363965285, "bertscore": 0.770947277545929, "recall": {"recall@1": 0, "recall@2": 0, "recall@3": 0}}}